apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_PINMUX_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_PINMUX_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rt118x/imxrt118x_iomuxc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Each IOMUXC_PAD_<pin>_<alt> constant is a packed uint32_t suitable for
 * use as the padcfg argument of IOMUX_PIN(padcfg, pad_ctl, sion) or
 * IOMUX_GPIO(padcfg, pad_ctl, gpio).  The layout and packing is defined
 * in imxrt118x_iomuxc.h.
 */

#define IOMUXC_PAD_GPIO_EMC_B1_00_SEMC_DATA00                                  IMXRT_PADCFG(0,   0, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_XBAR1_XBAR_INOUT04                           IMXRT_PADCFG(0,   0, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_SINC3_MOD_CLK0                               IMXRT_PADCFG(0,   0, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_LPUART3_CTS_B                                IMXRT_PADCFG(0,   0, 0x3, 0, 119, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_NETC_PINMUX_ETH3_TXD03                       IMXRT_PADCFG(0,   0, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_GPIO2_IO00                                   IMXRT_PADCFG(0,   0, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_KPP_ROW03                                    IMXRT_PADCFG(0,   0, 0x6, 0,  77, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00                             IMXRT_PADCFG(0,   0, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_NETC_PINMUX_ETH4_TXD03                       IMXRT_PADCFG(0,   0, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_ECAT_TX_DATA3_0                              IMXRT_PADCFG(0,   0, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_00_AHB_SRAMC_DATA00                             IMXRT_PADCFG(0,   0, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_01_SEMC_DATA01                                  IMXRT_PADCFG(0,   1, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_XBAR1_XBAR_INOUT05                           IMXRT_PADCFG(0,   1, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_SINC3_MOD_CLK1                               IMXRT_PADCFG(0,   1, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_LPUART3_RTS_B                                IMXRT_PADCFG(0,   1, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_NETC_PINMUX_ETH3_TXD02                       IMXRT_PADCFG(0,   1, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_GPIO2_IO01                                   IMXRT_PADCFG(0,   1, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_KPP_COL03                                    IMXRT_PADCFG(0,   1, 0x6, 0,  69, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01                             IMXRT_PADCFG(0,   1, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_NETC_PINMUX_ETH4_TXD02                       IMXRT_PADCFG(0,   1, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_ECAT_TX_DATA2_0                              IMXRT_PADCFG(0,   1, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_01_AHB_SRAMC_DATA01                             IMXRT_PADCFG(0,   1, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_02_SEMC_DATA02                                  IMXRT_PADCFG(0,   2, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_XBAR1_XBAR_INOUT06                           IMXRT_PADCFG(0,   2, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_SINC3_MOD_CLK2                               IMXRT_PADCFG(0,   2, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_LPUART3_RX                                   IMXRT_PADCFG(0,   2, 0x3, 0, 120, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_NETC_PINMUX_ETH3_RX_CLK                      IMXRT_PADCFG(0,   2, 0x4, 0, 222, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_GPIO2_IO02                                   IMXRT_PADCFG(0,   2, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_KPP_ROW02                                    IMXRT_PADCFG(0,   2, 0x6, 0,  76, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02                             IMXRT_PADCFG(0,   2, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_NETC_PINMUX_ETH4_RX_CLK                      IMXRT_PADCFG(0,   2, 0x9, 0, 230, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_ECAT_RX_CLK_0                                IMXRT_PADCFG(0,   2, 0xa, 0,   3, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_02_AHB_SRAMC_DATA02                             IMXRT_PADCFG(0,   2, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_03_SEMC_DATA03                                  IMXRT_PADCFG(0,   3, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_XBAR1_XBAR_INOUT07                           IMXRT_PADCFG(0,   3, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_SINC3_EMCLK00                                IMXRT_PADCFG(0,   3, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_LPUART3_TX                                   IMXRT_PADCFG(0,   3, 0x3, 0, 121, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_NETC_PINMUX_ETH3_RXD03                       IMXRT_PADCFG(0,   3, 0x4, 0, 228, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_GPIO2_IO03                                   IMXRT_PADCFG(0,   3, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_KPP_COL02                                    IMXRT_PADCFG(0,   3, 0x6, 0,  68, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03                             IMXRT_PADCFG(0,   3, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_NETC_PINMUX_ETH4_RXD03                       IMXRT_PADCFG(0,   3, 0x9, 0, 236, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_ECAT_RX_DATA3_0                              IMXRT_PADCFG(0,   3, 0xa, 0,  11, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_03_AHB_SRAMC_DATA03                             IMXRT_PADCFG(0,   3, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_04_SEMC_DATA04                                  IMXRT_PADCFG(0,   4, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_XBAR1_XBAR_INOUT08                           IMXRT_PADCFG(0,   4, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_SINC3_EMBIT00                                IMXRT_PADCFG(0,   4, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_LPUART3_DSR_B                                IMXRT_PADCFG(0,   4, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_NETC_PINMUX_ETH3_RXD02                       IMXRT_PADCFG(0,   4, 0x4, 0, 227, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_GPIO2_IO04                                   IMXRT_PADCFG(0,   4, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_KPP_ROW01                                    IMXRT_PADCFG(0,   4, 0x6, 0,  75, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_FLEXIO1_FLEXIO04                             IMXRT_PADCFG(0,   4, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_NETC_PINMUX_ETH4_RXD02                       IMXRT_PADCFG(0,   4, 0x9, 0, 235, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_ECAT_RX_DATA2_0                              IMXRT_PADCFG(0,   4, 0xa, 0,   9, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_04_AHB_SRAMC_DATA04                             IMXRT_PADCFG(0,   4, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_05_SEMC_DATA05                                  IMXRT_PADCFG(0,   5, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_XBAR1_XBAR_INOUT09                           IMXRT_PADCFG(0,   5, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_SINC3_EMCLK01                                IMXRT_PADCFG(0,   5, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_LPUART3_DCD_B                                IMXRT_PADCFG(0,   5, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_NETC_PINMUX_ETH3_TXD00                       IMXRT_PADCFG(0,   5, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_GPIO2_IO05                                   IMXRT_PADCFG(0,   5, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_KPP_ROW07                                    IMXRT_PADCFG(0,   5, 0x6, 0,  81, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_FLEXIO1_FLEXIO05                             IMXRT_PADCFG(0,   5, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_NETC_PINMUX_ETH4_TXD00                       IMXRT_PADCFG(0,   5, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_ECAT_TX_DATA0_0                              IMXRT_PADCFG(0,   5, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_05_AHB_SRAMC_DATA05                             IMXRT_PADCFG(0,   5, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

