apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B1_06_SEMC_DATA06                                  IMXRT_PADCFG(0,   6, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_FLEXPWM4_PWMB03                              IMXRT_PADCFG(0,   6, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_SINC3_EMBIT01                                IMXRT_PADCFG(0,   6, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_LPUART3_RI_B                                 IMXRT_PADCFG(0,   6, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_NETC_PINMUX_ETH3_TXD01                       IMXRT_PADCFG(0,   6, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_GPIO2_IO06                                   IMXRT_PADCFG(0,   6, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_KPP_COL07                                    IMXRT_PADCFG(0,   6, 0x6, 0,  73, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_FLEXIO1_FLEXIO06                             IMXRT_PADCFG(0,   6, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_NETC_PINMUX_ETH4_TXD01                       IMXRT_PADCFG(0,   6, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_ECAT_TX_DATA1_0                              IMXRT_PADCFG(0,   6, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_06_AHB_SRAMC_DATA06                             IMXRT_PADCFG(0,   6, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_07_SEMC_DATA07                                  IMXRT_PADCFG(0,   7, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_FLEXPWM4_PWMA03                              IMXRT_PADCFG(0,   7, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_SINC3_EMCLK02                                IMXRT_PADCFG(0,   7, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_LPUART3_DTR_B                                IMXRT_PADCFG(0,   7, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_NETC_PINMUX_ETH3_TX_EN                       IMXRT_PADCFG(0,   7, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_GPIO2_IO07                                   IMXRT_PADCFG(0,   7, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_KPP_ROW06                                    IMXRT_PADCFG(0,   7, 0x6, 0,  80, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_FLEXIO1_FLEXIO07                             IMXRT_PADCFG(0,   7, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_NETC_PINMUX_ETH4_TX_EN                       IMXRT_PADCFG(0,   7, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_ECAT_TX_EN_0                                 IMXRT_PADCFG(0,   7, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_07_AHB_SRAMC_DATA07                             IMXRT_PADCFG(0,   7, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_08_SEMC_DM00                                    IMXRT_PADCFG(0,   8, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_FLEXPWM2_PWMB03                              IMXRT_PADCFG(0,   8, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_SINC3_EMBIT02                                IMXRT_PADCFG(0,   8, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_LPUART4_DSR_B                                IMXRT_PADCFG(0,   8, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_NETC_PINMUX_ETH3_TX_CLK                      IMXRT_PADCFG(0,   8, 0x4, 0, 229, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_GPIO2_IO08                                   IMXRT_PADCFG(0,   8, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_KPP_COL06                                    IMXRT_PADCFG(0,   8, 0x6, 0,  72, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_FLEXIO1_FLEXIO08                             IMXRT_PADCFG(0,   8, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_NETC_PINMUX_ETH4_TX_CLK                      IMXRT_PADCFG(0,   8, 0x9, 0, 237, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_ECAT_TX_CLK_0                                IMXRT_PADCFG(0,   8, 0xa, 0,  17, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_08_AHB_SRAMC_LBB                                IMXRT_PADCFG(0,   8, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_09_SEMC_ADDR00                                  IMXRT_PADCFG(0,   9, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_FLEXPWM2_PWMA03                              IMXRT_PADCFG(0,   9, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_SINC3_EMCLK03                                IMXRT_PADCFG(0,   9, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_LPUART4_DCD_B                                IMXRT_PADCFG(0,   9, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_NETC_PINMUX_ETH3_RXD00                       IMXRT_PADCFG(0,   9, 0x4, 0, 225, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_GPIO2_IO09                                   IMXRT_PADCFG(0,   9, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_KPP_ROW05                                    IMXRT_PADCFG(0,   9, 0x6, 0,  79, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_FLEXIO1_FLEXIO09                             IMXRT_PADCFG(0,   9, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_NETC_PINMUX_ETH4_RXD00                       IMXRT_PADCFG(0,   9, 0x9, 0, 233, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_ECAT_RX_DATA0_0                              IMXRT_PADCFG(0,   9, 0xa, 0,   5, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_09_AHB_SRAMC_ADDR00                             IMXRT_PADCFG(0,   9, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_10_SEMC_ADDR01                                  IMXRT_PADCFG(0,  10, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_FLEXPWM3_PWMB03                              IMXRT_PADCFG(0,  10, 0x1, 0,  40, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_SINC3_EMBIT03                                IMXRT_PADCFG(0,  10, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_LPUART4_RI_B                                 IMXRT_PADCFG(0,  10, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_NETC_PINMUX_ETH3_RXD01                       IMXRT_PADCFG(0,  10, 0x4, 0, 226, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_GPIO2_IO10                                   IMXRT_PADCFG(0,  10, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_KPP_COL05                                    IMXRT_PADCFG(0,  10, 0x6, 0,  71, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_FLEXIO1_FLEXIO10                             IMXRT_PADCFG(0,  10, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_NETC_PINMUX_ETH4_RXD01                       IMXRT_PADCFG(0,  10, 0x9, 0, 234, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_ECAT_RX_DATA1_0                              IMXRT_PADCFG(0,  10, 0xa, 0,   7, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_10_AHB_SRAMC_ADDR01                             IMXRT_PADCFG(0,  10, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_11_SEMC_ADDR02                                  IMXRT_PADCFG(0,  11, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_FLEXPWM3_PWMA03                              IMXRT_PADCFG(0,  11, 0x1, 0,  36, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_SINC_FILTER_GLUE3_BREAK                      IMXRT_PADCFG(0,  11, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_LPUART4_DTR_B                                IMXRT_PADCFG(0,  11, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_NETC_PINMUX_ETH3_RX_DV                       IMXRT_PADCFG(0,  11, 0x4, 0, 223, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_GPIO2_IO11                                   IMXRT_PADCFG(0,  11, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_KPP_ROW04                                    IMXRT_PADCFG(0,  11, 0x6, 0,  78, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11                             IMXRT_PADCFG(0,  11, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_NETC_PINMUX_ETH4_RX_DV                       IMXRT_PADCFG(0,  11, 0x9, 0, 231, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_ECAT_RX_DV_0                                 IMXRT_PADCFG(0,  11, 0xa, 0,  13, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_11_AHB_SRAMC_ADDR02                             IMXRT_PADCFG(0,  11, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_12_SEMC_ADDR03                                  IMXRT_PADCFG(0,  12, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_FLEXPWM4_PWMA00                              IMXRT_PADCFG(0,  12, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_LPUART4_TX                                   IMXRT_PADCFG(0,  12, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_NETC_PINMUX_ETH3_RX_ER                       IMXRT_PADCFG(0,  12, 0x4, 0, 224, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_GPIO2_IO12                                   IMXRT_PADCFG(0,  12, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_KPP_COL04                                    IMXRT_PADCFG(0,  12, 0x6, 0,  70, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12                             IMXRT_PADCFG(0,  12, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_NETC_PINMUX_ETH4_RX_ER                       IMXRT_PADCFG(0,  12, 0x9, 0, 232, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_ECAT_PT0_RX_ER                               IMXRT_PADCFG(0,  12, 0xa, 0,  15, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_12_AHB_SRAMC_ADDR03                             IMXRT_PADCFG(0,  12, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_13_SEMC_ADDR04                                  IMXRT_PADCFG(0,  13, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_FLEXPWM4_PWMB00                              IMXRT_PADCFG(0,  13, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_LPUART4_RX                                   IMXRT_PADCFG(0,  13, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_NETC_PINMUX_ETH2_RX_DV                       IMXRT_PADCFG(0,  13, 0x3, 0, 215, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_NETC_PINMUX_ETH3_TX_ER                       IMXRT_PADCFG(0,  13, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_GPIO2_IO13                                   IMXRT_PADCFG(0,  13, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_KPP_COL01                                    IMXRT_PADCFG(0,  13, 0x6, 0,  67, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13                             IMXRT_PADCFG(0,  13, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_NETC_PINMUX_ETH4_TX_ER                       IMXRT_PADCFG(0,  13, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_QTIMER1_TIMER1                               IMXRT_PADCFG(0,  13, 0xa, 0, 239, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_13_AHB_SRAMC_ADDR04                             IMXRT_PADCFG(0,  13, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_14_SEMC_ADDR05                                  IMXRT_PADCFG(0,  14, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_FLEXPWM4_PWMA01                              IMXRT_PADCFG(0,  14, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_LPUART5_TX                                   IMXRT_PADCFG(0,  14, 0x2, 0, 128, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_NETC_PINMUX_ETH2_TX_EN                       IMXRT_PADCFG(0,  14, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_NETC_ETH3_CRS                                IMXRT_PADCFG(0,  14, 0x4, 0, 196, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_GPIO2_IO14                                   IMXRT_PADCFG(0,  14, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_KPP_ROW00                                    IMXRT_PADCFG(0,  14, 0x6, 0,  74, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_FLEXIO1_FLEXIO14                             IMXRT_PADCFG(0,  14, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_NETC_ETH4_CRS                                IMXRT_PADCFG(0,  14, 0x9, 0, 200, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_LPUART4_CTS_B                                IMXRT_PADCFG(0,  14, 0xa, 0, 122, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_14_AHB_SRAMC_ADDR05                             IMXRT_PADCFG(0,  14, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_15_SEMC_ADDR06                                  IMXRT_PADCFG(0,  15, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_FLEXPWM4_PWMB01                              IMXRT_PADCFG(0,  15, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_LPUART5_RX                                   IMXRT_PADCFG(0,  15, 0x2, 0, 127, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_NETC_PINMUX_ETH2_TX_CLK                      IMXRT_PADCFG(0,  15, 0x3, 0, 221, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_NETC_ETH3_COL                                IMXRT_PADCFG(0,  15, 0x4, 0, 195, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_GPIO2_IO15                                   IMXRT_PADCFG(0,  15, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_KPP_COL00                                    IMXRT_PADCFG(0,  15, 0x6, 0,  66, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_FLEXIO1_FLEXIO15                             IMXRT_PADCFG(0,  15, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_NETC_ETH4_COL                                IMXRT_PADCFG(0,  15, 0x9, 0, 199, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_LPUART4_RTS_B                                IMXRT_PADCFG(0,  15, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_15_AHB_SRAMC_ADDR06                             IMXRT_PADCFG(0,  15, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

