apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B1_16_SEMC_ADDR07                                  IMXRT_PADCFG(0,  16, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_FLEXPWM4_PWMB02                              IMXRT_PADCFG(0,  16, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_LPUART9_TX                                   IMXRT_PADCFG(0,  16, 0x2, 0, 139, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_NETC_PINMUX_ETH2_RXD00                       IMXRT_PADCFG(0,  16, 0x3, 0, 217, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_NETC_ETH3_SLV_MDC                            IMXRT_PADCFG(0,  16, 0x4, 0, 197, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_GPIO2_IO16                                   IMXRT_PADCFG(0,  16, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_NETC_ETH4_SLV_MDC                            IMXRT_PADCFG(0,  16, 0x6, 0, 201, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_FLEXIO1_FLEXIO16                             IMXRT_PADCFG(0,  16, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_NETC_ETH2_SLV_MDC                            IMXRT_PADCFG(0,  16, 0x9, 0, 193, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_LPSPI6_PCS2                                  IMXRT_PADCFG(0,  16, 0xa, 0, 110, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_16_AHB_SRAMC_ADDR07                             IMXRT_PADCFG(0,  16, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_17_SEMC_ADDR08                                  IMXRT_PADCFG(0,  17, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_FLEXPWM4_PWMA02                              IMXRT_PADCFG(0,  17, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_LPUART9_RX                                   IMXRT_PADCFG(0,  17, 0x2, 0, 138, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_NETC_PINMUX_ETH2_RXD01                       IMXRT_PADCFG(0,  17, 0x3, 0, 218, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_NETC_ETH3_SLV_MDIO                           IMXRT_PADCFG(0,  17, 0x4, 0, 198, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_GPIO2_IO17                                   IMXRT_PADCFG(0,  17, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_NETC_ETH4_SLV_MDIO                           IMXRT_PADCFG(0,  17, 0x6, 0, 202, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_FLEXIO1_FLEXIO17                             IMXRT_PADCFG(0,  17, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_NETC_ETH2_SLV_MDIO                           IMXRT_PADCFG(0,  17, 0x9, 0, 194, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_LPSPI6_PCS1                                  IMXRT_PADCFG(0,  17, 0xa, 0, 109, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_17_AHB_SRAMC_ADDR08                             IMXRT_PADCFG(0,  17, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_18_SEMC_ADDR09                                  IMXRT_PADCFG(0,  18, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_FLEXPWM2_PWMA00                              IMXRT_PADCFG(0,  18, 0x1, 0,  27, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_QTIMER1_TIMER0                               IMXRT_PADCFG(0,  18, 0x2, 0, 238, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_LPSPI6_SCK                                   IMXRT_PADCFG(0,  18, 0x3, 0, 112, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_NETC_ETH2_CRS                                IMXRT_PADCFG(0,  18, 0x4, 0, 192, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_GPIO2_IO18                                   IMXRT_PADCFG(0,  18, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_FLEXIO1_FLEXIO18                             IMXRT_PADCFG(0,  18, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_NETC_EMDC                                    IMXRT_PADCFG(0,  18, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_18_AHB_SRAMC_ADDR09                             IMXRT_PADCFG(0,  18, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_19_SEMC_ADDR11                                  IMXRT_PADCFG(0,  19, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_FLEXPWM2_PWMB00                              IMXRT_PADCFG(0,  19, 0x1, 0,  30, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_QTIMER2_TIMER0                               IMXRT_PADCFG(0,  19, 0x2, 0, 241, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_LPSPI6_SDI                                   IMXRT_PADCFG(0,  19, 0x3, 0, 113, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_NETC_ETH2_COL                                IMXRT_PADCFG(0,  19, 0x4, 0, 191, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_GPIO2_IO19                                   IMXRT_PADCFG(0,  19, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_FLEXIO1_FLEXIO19                             IMXRT_PADCFG(0,  19, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_NETC_EMDIO                                   IMXRT_PADCFG(0,  19, 0xa, 0, 190, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_19_AHB_SRAMC_ADDR11                             IMXRT_PADCFG(0,  19, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_20_SEMC_ADDR12                                  IMXRT_PADCFG(0,  20, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_FLEXPWM2_PWMA01                              IMXRT_PADCFG(0,  20, 0x1, 0,  28, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_QTIMER3_TIMER0                               IMXRT_PADCFG(0,  20, 0x2, 0, 244, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_LPSPI6_SDO                                   IMXRT_PADCFG(0,  20, 0x3, 0, 114, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_NETC_PINMUX_ETH2_TX_ER                       IMXRT_PADCFG(0,  20, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_GPIO2_IO20                                   IMXRT_PADCFG(0,  20, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_FLEXIO1_FLEXIO20                             IMXRT_PADCFG(0,  20, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_20_AHB_SRAMC_ADDR12                             IMXRT_PADCFG(0,  20, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

