apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B1_21_SEMC_BA0                                     IMXRT_PADCFG(0,  21, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_FLEXPWM2_PWMB01                              IMXRT_PADCFG(0,  21, 0x1, 0,  31, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_QTIMER4_TIMER0                               IMXRT_PADCFG(0,  21, 0x2, 0, 247, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_LPSPI6_PCS0                                  IMXRT_PADCFG(0,  21, 0x3, 0, 108, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_NETC_PINMUX_ETH2_RX_CLK                      IMXRT_PADCFG(0,  21, 0x4, 0, 214, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_GPIO2_IO21                                   IMXRT_PADCFG(0,  21, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_FLEXIO1_FLEXIO21                             IMXRT_PADCFG(0,  21, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_LPUART4_CTS_B                                IMXRT_PADCFG(0,  21, 0x9, 0, 122, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_21_FLEXSPI2_BUS2BIT_B_DQS                       IMXRT_PADCFG(0,  21, 0xa, 0,  53, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_21_AHB_SRAMC_ADDR13                             IMXRT_PADCFG(0,  21, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_22_SEMC_BA1                                     IMXRT_PADCFG(0,  22, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_FLEXPWM2_PWMB02                              IMXRT_PADCFG(0,  22, 0x1, 0,  32, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_QTIMER5_TIMER0                               IMXRT_PADCFG(0,  22, 0x2, 0, 250, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_LPSPI4_SCK                                   IMXRT_PADCFG(0,  22, 0x3, 0,  98, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_NETC_PINMUX_ETH2_RXD02                       IMXRT_PADCFG(0,  22, 0x4, 0, 219, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_GPIO2_IO22                                   IMXRT_PADCFG(0,  22, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_FLEXIO1_FLEXIO22                             IMXRT_PADCFG(0,  22, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_LPUART4_RTS_B                                IMXRT_PADCFG(0,  22, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_FLEXSPI2_BUS2BIT_B_DATA03                    IMXRT_PADCFG(0,  22, 0xa, 0,  61, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_22_AHB_SRAMC_ADDR14                             IMXRT_PADCFG(0,  22, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_23_SEMC_ADDR10                                  IMXRT_PADCFG(0,  23, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_FLEXPWM2_PWMA02                              IMXRT_PADCFG(0,  23, 0x1, 0,  29, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_QTIMER6_TIMER0                               IMXRT_PADCFG(0,  23, 0x2, 0, 253, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_LPSPI4_SDI                                   IMXRT_PADCFG(0,  23, 0x3, 0,  99, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_NETC_PINMUX_ETH2_RXD03                       IMXRT_PADCFG(0,  23, 0x4, 0, 220, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_GPIO2_IO23                                   IMXRT_PADCFG(0,  23, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_FLEXIO1_FLEXIO23                             IMXRT_PADCFG(0,  23, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_FLEXSPI2_BUS2BIT_B_DATA02                    IMXRT_PADCFG(0,  23, 0xa, 0,  60, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_23_AHB_SRAMC_ADDR10                             IMXRT_PADCFG(0,  23, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_24_SEMC_CAS                                     IMXRT_PADCFG(0,  24, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_FLEXPWM1_PWMA00                              IMXRT_PADCFG(0,  24, 0x1, 0,  21, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_QTIMER7_TIMER0                               IMXRT_PADCFG(0,  24, 0x2, 0, 256, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_LPSPI4_SDO                                   IMXRT_PADCFG(0,  24, 0x3, 0, 100, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_NETC_PINMUX_ETH2_TXD03                       IMXRT_PADCFG(0,  24, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_GPIO2_IO24                                   IMXRT_PADCFG(0,  24, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_FLEXIO1_FLEXIO24                             IMXRT_PADCFG(0,  24, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_NETC_ETH3_SLV_MDC                            IMXRT_PADCFG(0,  24, 0x9, 0, 197, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_24_FLEXSPI2_BUS2BIT_B_DATA01                    IMXRT_PADCFG(0,  24, 0xa, 0,  59, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_24_AHB_SRAMC_ADDR15                             IMXRT_PADCFG(0,  24, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_25_SEMC_RAS                                     IMXRT_PADCFG(0,  25, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_FLEXPWM1_PWMB00                              IMXRT_PADCFG(0,  25, 0x1, 0,  24, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_QTIMER8_TIMER0                               IMXRT_PADCFG(0,  25, 0x2, 0, 258, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_LPSPI4_PCS0                                  IMXRT_PADCFG(0,  25, 0x3, 0,  97, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_NETC_PINMUX_ETH2_TXD02                       IMXRT_PADCFG(0,  25, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_GPIO2_IO25                                   IMXRT_PADCFG(0,  25, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_FLEXIO1_FLEXIO25                             IMXRT_PADCFG(0,  25, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_NETC_ETH3_SLV_MDIO                           IMXRT_PADCFG(0,  25, 0x9, 0, 198, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_25_FLEXSPI2_BUS2BIT_B_DATA00                    IMXRT_PADCFG(0,  25, 0xa, 0,  58, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_25_AHB_SRAMC_ADDR16                             IMXRT_PADCFG(0,  25, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_26_SEMC_CLK                                     IMXRT_PADCFG(0,  26, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_FLEXPWM1_PWMA01                              IMXRT_PADCFG(0,  26, 0x1, 0,  22, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_XBAR1_XBAR_INOUT10                           IMXRT_PADCFG(0,  26, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_FLEXSPI2_BUS2BIT_A_SS1_B                     IMXRT_PADCFG(0,  26, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_NETC_PINMUX_ETH2_TXD01                       IMXRT_PADCFG(0,  26, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_GPIO2_IO26                                   IMXRT_PADCFG(0,  26, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_ECAT_TX_DATA1_1                              IMXRT_PADCFG(0,  26, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_26_LPSPI6_SCK                                   IMXRT_PADCFG(0,  26, 0xa, 0, 112, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_26_AHB_SRAMC_WE                                 IMXRT_PADCFG(0,  26, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_27_SEMC_CKE                                     IMXRT_PADCFG(0,  27, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_FLEXPWM1_PWMB01                              IMXRT_PADCFG(0,  27, 0x1, 0,  25, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_XBAR1_XBAR_INOUT11                           IMXRT_PADCFG(0,  27, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_FLEXSPI2_BUS2BIT_B_SS1_B                     IMXRT_PADCFG(0,  27, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_NETC_PINMUX_ETH2_TXD00                       IMXRT_PADCFG(0,  27, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_GPIO2_IO27                                   IMXRT_PADCFG(0,  27, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_ECAT_TX_DATA0_1                              IMXRT_PADCFG(0,  27, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_LPUART6_RI_B                                 IMXRT_PADCFG(0,  27, 0x9, 0, 132, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_27_LPSPI6_SDI                                   IMXRT_PADCFG(0,  27, 0xa, 0, 113, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_27_AHB_SRAMC_OEB                                IMXRT_PADCFG(0,  27, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_28_SEMC_WE                                      IMXRT_PADCFG(0,  28, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_FLEXPWM1_PWMB02                              IMXRT_PADCFG(0,  28, 0x1, 0,  26, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_XBAR1_XBAR_INOUT12                           IMXRT_PADCFG(0,  28, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_FLEXSPI2_BUS2BIT_B_SS0_B                     IMXRT_PADCFG(0,  28, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_NETC_PINMUX_ETH2_TX_EN                       IMXRT_PADCFG(0,  28, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_GPIO2_IO28                                   IMXRT_PADCFG(0,  28, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_ECAT_TX_EN_1                                 IMXRT_PADCFG(0,  28, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_LPUART6_DTR_B                                IMXRT_PADCFG(0,  28, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_28_LPSPI6_SDO                                   IMXRT_PADCFG(0,  28, 0xa, 0, 114, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_28_AHB_SRAMC_ADV                                IMXRT_PADCFG(0,  28, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

