apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B1_29_SEMC_CS0                                     IMXRT_PADCFG(0,  29, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_FLEXPWM1_PWMA02                              IMXRT_PADCFG(0,  29, 0x1, 0,  23, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_XBAR1_XBAR_INOUT13                           IMXRT_PADCFG(0,  29, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_FLEXSPI2_BUS2BIT_B_DQS                       IMXRT_PADCFG(0,  29, 0x3, 0,  53, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_29_NETC_PINMUX_ETH2_TX_CLK                      IMXRT_PADCFG(0,  29, 0x4, 0, 221, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_29_GPIO2_IO29                                   IMXRT_PADCFG(0,  29, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_ECAT_TX_CLK_1                                IMXRT_PADCFG(0,  29, 0x6, 0,  18, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_LPUART6_DCD_B                                IMXRT_PADCFG(0,  29, 0x9, 0, 130, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_29_LPSPI6_PCS0                                  IMXRT_PADCFG(0,  29, 0xa, 0, 108, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_29_AHB_SRAMC_CS0                                IMXRT_PADCFG(0,  29, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_30_SEMC_DATA08                                  IMXRT_PADCFG(0,  30, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_FLEXPWM3_PWMA00                              IMXRT_PADCFG(0,  30, 0x1, 0,  33, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_XBAR1_XBAR_INOUT14                           IMXRT_PADCFG(0,  30, 0x2, 0, 293, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03                    IMXRT_PADCFG(0,  30, 0x3, 0,  61, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_30_NETC_PINMUX_ETH2_RXD00                       IMXRT_PADCFG(0,  30, 0x4, 0, 217, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_30_GPIO2_IO30                                   IMXRT_PADCFG(0,  30, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_ECAT_RX_DATA0_1                              IMXRT_PADCFG(0,  30, 0x6, 0,   6, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_LPUART6_DSR_B                                IMXRT_PADCFG(0,  30, 0x9, 0, 131, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_30_LPSPI6_PCS1                                  IMXRT_PADCFG(0,  30, 0xa, 0, 109, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_30_AHB_SRAMC_DATA08                             IMXRT_PADCFG(0,  30, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_31_SEMC_DATA09                                  IMXRT_PADCFG(0,  31, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_FLEXPWM3_PWMB00                              IMXRT_PADCFG(0,  31, 0x1, 0,  37, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_LPUART6_TX                                   IMXRT_PADCFG(0,  31, 0x2, 0, 134, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02                    IMXRT_PADCFG(0,  31, 0x3, 0,  60, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_31_NETC_PINMUX_ETH2_RXD01                       IMXRT_PADCFG(0,  31, 0x4, 0, 218, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_31_GPIO2_IO31                                   IMXRT_PADCFG(0,  31, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_ECAT_RX_DATA1_1                              IMXRT_PADCFG(0,  31, 0x6, 0,   8, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_LPSPI5_SCK                                   IMXRT_PADCFG(0,  31, 0x9, 0, 105, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_31_LPSPI6_PCS2                                  IMXRT_PADCFG(0,  31, 0xa, 0, 110, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_31_AHB_SRAMC_DATA09                             IMXRT_PADCFG(0,  31, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_32_SEMC_DATA10                                  IMXRT_PADCFG(0,  32, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_FLEXPWM3_PWMA01                              IMXRT_PADCFG(0,  32, 0x1, 0,  34, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_LPUART6_RX                                   IMXRT_PADCFG(0,  32, 0x2, 0, 133, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01                    IMXRT_PADCFG(0,  32, 0x3, 0,  59, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_32_NETC_PINMUX_ETH2_RX_DV                       IMXRT_PADCFG(0,  32, 0x4, 0, 215, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_32_GPIO3_IO00                                   IMXRT_PADCFG(0,  32, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_ECAT_RX_DV_1                                 IMXRT_PADCFG(0,  32, 0x6, 0,  14, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_LPSPI5_SDO                                   IMXRT_PADCFG(0,  32, 0x9, 0, 107, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_LPSPI6_PCS3                                  IMXRT_PADCFG(0,  32, 0xa, 0, 111, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_32_AHB_SRAMC_DATA10                             IMXRT_PADCFG(0,  32, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_33_SEMC_DATA11                                  IMXRT_PADCFG(0,  33, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_FLEXPWM3_PWMB01                              IMXRT_PADCFG(0,  33, 0x1, 0,  38, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_LPUART6_CTS_B                                IMXRT_PADCFG(0,  33, 0x2, 0, 129, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00                    IMXRT_PADCFG(0,  33, 0x3, 0,  58, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_33_NETC_PINMUX_ETH2_RX_ER                       IMXRT_PADCFG(0,  33, 0x4, 0, 216, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_GPIO3_IO01                                   IMXRT_PADCFG(0,  33, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_ECAT_RX_ER_1                                 IMXRT_PADCFG(0,  33, 0x6, 0,  16, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_LPSPI5_SDI                                   IMXRT_PADCFG(0,  33, 0x9, 0, 106, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_33_NETC_PINMUX_ETH2_RX_CLK                      IMXRT_PADCFG(0,  33, 0xa, 0, 214, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_33_AHB_SRAMC_DATA11                             IMXRT_PADCFG(0,  33, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_34_SEMC_DATA12                                  IMXRT_PADCFG(0,  34, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_FLEXPWM3_PWMB02                              IMXRT_PADCFG(0,  34, 0x1, 0,  39, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_LPUART6_RTS_B                                IMXRT_PADCFG(0,  34, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK                      IMXRT_PADCFG(0,  34, 0x3, 0,  63, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_NETC_PINMUX_ETH2_RXD02                       IMXRT_PADCFG(0,  34, 0x4, 0, 219, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_34_GPIO3_IO02                                   IMXRT_PADCFG(0,  34, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_ECAT_RX_DATA2_1                              IMXRT_PADCFG(0,  34, 0x6, 0,  10, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_NETC_PINMUX_ETH0_TXD00                       IMXRT_PADCFG(0,  34, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_LPSPI5_PCS0                                  IMXRT_PADCFG(0,  34, 0xa, 0, 101, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_34_AHB_SRAMC_DATA12                             IMXRT_PADCFG(0,  34, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_35_SEMC_DATA13                                  IMXRT_PADCFG(0,  35, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_FLEXPWM3_PWMA02                              IMXRT_PADCFG(0,  35, 0x1, 0,  35, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_LPUART5_TX                                   IMXRT_PADCFG(0,  35, 0x2, 0, 128, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00                    IMXRT_PADCFG(0,  35, 0x3, 0,  54, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_NETC_PINMUX_ETH2_RXD03                       IMXRT_PADCFG(0,  35, 0x4, 0, 220, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_35_GPIO3_IO03                                   IMXRT_PADCFG(0,  35, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_ECAT_RX_DATA3_1                              IMXRT_PADCFG(0,  35, 0x6, 0,  12, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_NETC_PINMUX_ETH0_TXD01                       IMXRT_PADCFG(0,  35, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_LPSPI5_PCS1                                  IMXRT_PADCFG(0,  35, 0xa, 0, 102, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_35_AHB_SRAMC_DATA13                             IMXRT_PADCFG(0,  35, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_36_SEMC_DATA14                                  IMXRT_PADCFG(0,  36, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_FLEXPWM1_PWMA00                              IMXRT_PADCFG(0,  36, 0x1, 0,  21, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_36_LPUART5_RX                                   IMXRT_PADCFG(0,  36, 0x2, 0, 127, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01                    IMXRT_PADCFG(0,  36, 0x3, 0,  55, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_NETC_PINMUX_ETH2_TXD03                       IMXRT_PADCFG(0,  36, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_GPIO3_IO04                                   IMXRT_PADCFG(0,  36, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_ECAT_TX_DATA3_1                              IMXRT_PADCFG(0,  36, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_NETC_PINMUX_ETH0_TX_EN                       IMXRT_PADCFG(0,  36, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_36_AHB_SRAMC_DATA14                             IMXRT_PADCFG(0,  36, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_37_SEMC_DATA15                                  IMXRT_PADCFG(0,  37, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_FLEXPWM1_PWMB00                              IMXRT_PADCFG(0,  37, 0x1, 0,  24, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_37_LPUART5_CTS_B                                IMXRT_PADCFG(0,  37, 0x2, 0, 123, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02                    IMXRT_PADCFG(0,  37, 0x3, 0,  56, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_NETC_PINMUX_ETH2_TXD02                       IMXRT_PADCFG(0,  37, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_GPIO3_IO05                                   IMXRT_PADCFG(0,  37, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_ECAT_TX_DATA2_1                              IMXRT_PADCFG(0,  37, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_NETC_PINMUX_ETH0_TX_CLK                      IMXRT_PADCFG(0,  37, 0x9, 0, 213, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_37_AHB_SRAMC_DATA15                             IMXRT_PADCFG(0,  37, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

