apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B1_38_SEMC_DM01                                    IMXRT_PADCFG(0,  38, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_FLEXPWM1_PWMB03                              IMXRT_PADCFG(0,  38, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_LPUART5_RTS_B                                IMXRT_PADCFG(0,  38, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03                    IMXRT_PADCFG(0,  38, 0x3, 0,  57, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_NETC_PINMUX_ETH2_RX_CLK                      IMXRT_PADCFG(0,  38, 0x4, 0, 214, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B1_38_GPIO3_IO06                                   IMXRT_PADCFG(0,  38, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_ECAT_RX_CLK_1                                IMXRT_PADCFG(0,  38, 0x6, 0,   4, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_NETC_PINMUX_ETH0_RXD00                       IMXRT_PADCFG(0,  38, 0x9, 0, 209, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_38_AHB_SRAMC_UBB                                IMXRT_PADCFG(0,  38, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_39_SEMC_DQS                                     IMXRT_PADCFG(0,  39, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_FLEXPWM1_PWMA03                              IMXRT_PADCFG(0,  39, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_XBAR1_XBAR_INOUT15                           IMXRT_PADCFG(0,  39, 0x2, 0, 294, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_FLEXSPI2_BUS2BIT_A_SS0_B                     IMXRT_PADCFG(0,  39, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_NETC_PINMUX_ETH2_TX_ER                       IMXRT_PADCFG(0,  39, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_GPIO3_IO07                                   IMXRT_PADCFG(0,  39, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_QTIMER2_TIMER1                               IMXRT_PADCFG(0,  39, 0x6, 0, 242, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_NETC_PINMUX_ETH0_RXD01                       IMXRT_PADCFG(0,  39, 0x9, 0, 210, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_39_AHB_SRAMC_CS1                                IMXRT_PADCFG(0,  39, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_40_SEMC_RDY                                     IMXRT_PADCFG(0,  40, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_NETC_EMDC                                    IMXRT_PADCFG(0,  40, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_NETC_ETH2_SLV_MDC                            IMXRT_PADCFG(0,  40, 0x2, 0, 193, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS                       IMXRT_PADCFG(0,  40, 0x3, 0,  52, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_NETC_ETH2_CRS                                IMXRT_PADCFG(0,  40, 0x4, 0, 192, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_40_GPIO3_IO08                                   IMXRT_PADCFG(0,  40, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_QTIMER3_TIMER1                               IMXRT_PADCFG(0,  40, 0x6, 0, 245, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_NETC_PINMUX_ETH0_RX_DV                       IMXRT_PADCFG(0,  40, 0x9, 0, 207, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_40_AHB_SRAMC_CS2                                IMXRT_PADCFG(0,  40, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B1_41_SEMC_CSX00                                   IMXRT_PADCFG(0,  41, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_41_NETC_EMDIO                                   IMXRT_PADCFG(0,  41, 0x1, 0, 190, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_41_NETC_ETH2_SLV_MDIO                           IMXRT_PADCFG(0,  41, 0x2, 0, 194, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK                      IMXRT_PADCFG(0,  41, 0x3, 0,  62, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_41_NETC_ETH2_COL                                IMXRT_PADCFG(0,  41, 0x4, 0, 191, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B1_41_GPIO3_IO09                                   IMXRT_PADCFG(0,  41, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B1_41_QTIMER4_TIMER1                               IMXRT_PADCFG(0,  41, 0x6, 0, 248, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_41_NETC_PINMUX_ETH0_RX_ER                       IMXRT_PADCFG(0,  41, 0x9, 0, 208, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B1_41_AHB_SRAMC_CS3                                IMXRT_PADCFG(0,  41, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_00_SEMC_DATA16                                  IMXRT_PADCFG(0,  42, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_CCM_ENET_REF_CLK_25M                         IMXRT_PADCFG(0,  42, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_QTIMER5_TIMER1                               IMXRT_PADCFG(0,  42, 0x2, 0, 251, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_NETC_EMDC                                    IMXRT_PADCFG(0,  42, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_NETC_PINMUX_ETH0_RX_CLK                      IMXRT_PADCFG(0,  42, 0x4, 0, 206, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_GPIO3_IO10                                   IMXRT_PADCFG(0,  42, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_XBAR1_XBAR_INOUT20                           IMXRT_PADCFG(0,  42, 0x6, 0, 298, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_LPSPI5_SCK                                   IMXRT_PADCFG(0,  42, 0x8, 0, 105, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_00_LPI2C3_SCL                                   IMXRT_PADCFG(0,  42, 0x9, 0,  82, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_00_FLEXPWM3_PWMA00                              IMXRT_PADCFG(0,  42, 0xa, 0,  33, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_00_ECAT_RX_CLK_0                                IMXRT_PADCFG(0,  42, 0xc, 0,   3, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_01_SEMC_DATA17                                  IMXRT_PADCFG(0,  43, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_USDHC2_CD_B                                  IMXRT_PADCFG(0,  43, 0x1, 0, 291, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_QTIMER6_TIMER1                               IMXRT_PADCFG(0,  43, 0x2, 0, 254, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_NETC_EMDIO                                   IMXRT_PADCFG(0,  43, 0x3, 0, 190, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B2_01_NETC_PINMUX_ETH0_RXD02                       IMXRT_PADCFG(0,  43, 0x4, 0, 211, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_GPIO3_IO11                                   IMXRT_PADCFG(0,  43, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_XBAR1_XBAR_INOUT21                           IMXRT_PADCFG(0,  43, 0x6, 0, 299, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_LPSPI5_PCS0                                  IMXRT_PADCFG(0,  43, 0x8, 0, 101, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_01_LPI2C3_SDA                                   IMXRT_PADCFG(0,  43, 0x9, 0,  83, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_01_FLEXPWM3_PWMB00                              IMXRT_PADCFG(0,  43, 0xa, 0,  37, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_01_ECAT_RX_DATA2_0                              IMXRT_PADCFG(0,  43, 0xc, 0,   9, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_02_SEMC_DATA18                                  IMXRT_PADCFG(0,  44, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_USDHC2_WP                                    IMXRT_PADCFG(0,  44, 0x1, 0, 292, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_QTIMER7_TIMER1                               IMXRT_PADCFG(0,  44, 0x2, 0, 257, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_NETC_PINMUX_ETH0_RXD03                       IMXRT_PADCFG(0,  44, 0x4, 0, 212, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_GPIO3_IO12                                   IMXRT_PADCFG(0,  44, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_XBAR1_XBAR_INOUT22                           IMXRT_PADCFG(0,  44, 0x6, 0, 300, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_LPSPI5_SDO                                   IMXRT_PADCFG(0,  44, 0x8, 0, 107, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_02_CCM_CLKO1                                    IMXRT_PADCFG(0,  44, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_02_FLEXPWM3_PWMA01                              IMXRT_PADCFG(0,  44, 0xa, 0,  34, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_02_ECAT_RX_DATA3_0                              IMXRT_PADCFG(0,  44, 0xc, 0,  11, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_03_SEMC_DATA19                                  IMXRT_PADCFG(0,  45, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_USDHC2_VSELECT                               IMXRT_PADCFG(0,  45, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_QTIMER8_TIMER1                               IMXRT_PADCFG(0,  45, 0x2, 0, 259, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_NETC_PINMUX_ETH0_TXD02                       IMXRT_PADCFG(0,  45, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_GPIO3_IO13                                   IMXRT_PADCFG(0,  45, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_XBAR1_XBAR_INOUT23                           IMXRT_PADCFG(0,  45, 0x6, 0, 301, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_03_LPSPI5_SDI                                   IMXRT_PADCFG(0,  45, 0x8, 0, 106, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_03_NETC_ETH3_CRS                                IMXRT_PADCFG(0,  45, 0x9, 0, 196, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_03_FLEXPWM3_PWMB01                              IMXRT_PADCFG(0,  45, 0xa, 0,  38, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_03_ECAT_TX_DATA2_0                              IMXRT_PADCFG(0,  45, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_04_SEMC_DATA20                                  IMXRT_PADCFG(0,  46, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_USDHC2_RESET_B                               IMXRT_PADCFG(0,  46, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_SAI2_MCLK                                    IMXRT_PADCFG(0,  46, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_NETC_PINMUX_ETH0_TXD03                       IMXRT_PADCFG(0,  46, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_GPIO3_IO14                                   IMXRT_PADCFG(0,  46, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_XBAR1_XBAR_INOUT24                           IMXRT_PADCFG(0,  46, 0x6, 0, 302, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_LPSPI3_SCK                                   IMXRT_PADCFG(0,  46, 0x8, 0,  94, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_04_NETC_ETH3_COL                                IMXRT_PADCFG(0,  46, 0x9, 0, 195, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_04_FLEXPWM3_PWMB02                              IMXRT_PADCFG(0,  46, 0xa, 0,  39, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_04_ECAT_TX_DATA3_0                              IMXRT_PADCFG(0,  46, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_05_SEMC_DATA21                                  IMXRT_PADCFG(0,  47, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_NETC_ETH4_SLV_MDC                            IMXRT_PADCFG(0,  47, 0x1, 0, 201, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_05_SAI2_RX_SYNC                                 IMXRT_PADCFG(0,  47, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_NETC_PINMUX_ETH0_TXD00                       IMXRT_PADCFG(0,  47, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_NETC_ETH4_CRS                                IMXRT_PADCFG(0,  47, 0x4, 0, 200, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_05_GPIO3_IO15                                   IMXRT_PADCFG(0,  47, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_XBAR1_XBAR_INOUT25                           IMXRT_PADCFG(0,  47, 0x6, 0, 303, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_LPSPI3_PCS0                                  IMXRT_PADCFG(0,  47, 0x8, 0,  90, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_NETC_PINMUX_ETH3_TXD00                       IMXRT_PADCFG(0,  47, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_05_FLEXPWM3_PWMA02                              IMXRT_PADCFG(0,  47, 0xa, 0,  35, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_05_ECAT_TX_DATA0_0                              IMXRT_PADCFG(0,  47, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_06_SEMC_DATA22                                  IMXRT_PADCFG(0,  48, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_NETC_ETH4_SLV_MDIO                           IMXRT_PADCFG(0,  48, 0x1, 0, 202, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_06_SAI2_RX_BCLK                                 IMXRT_PADCFG(0,  48, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_NETC_PINMUX_ETH0_TXD01                       IMXRT_PADCFG(0,  48, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_NETC_ETH4_COL                                IMXRT_PADCFG(0,  48, 0x4, 0, 199, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_06_GPIO3_IO16                                   IMXRT_PADCFG(0,  48, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_XBAR1_XBAR_INOUT26                           IMXRT_PADCFG(0,  48, 0x6, 0, 304, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_LPSPI3_SDO                                   IMXRT_PADCFG(0,  48, 0x8, 0,  96, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_NETC_PINMUX_ETH3_TXD01                       IMXRT_PADCFG(0,  48, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_06_FLEXPWM3_PWMB03                              IMXRT_PADCFG(0,  48, 0xa, 0,  40, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_06_ECAT_TX_DATA1_0                              IMXRT_PADCFG(0,  48, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

