apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B2_07_SEMC_DATA23                                  IMXRT_PADCFG(0,  49, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_NETC_PINMUX_ETH4_TX_ER                       IMXRT_PADCFG(0,  49, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_SAI2_RX_DATA                                 IMXRT_PADCFG(0,  49, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_NETC_PINMUX_ETH0_TX_EN                       IMXRT_PADCFG(0,  49, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_GPIO3_IO17                                   IMXRT_PADCFG(0,  49, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_XBAR1_XBAR_INOUT27                           IMXRT_PADCFG(0,  49, 0x6, 0, 305, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_LPSPI3_SDI                                   IMXRT_PADCFG(0,  49, 0x8, 0,  95, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_NETC_PINMUX_ETH3_TX_EN                       IMXRT_PADCFG(0,  49, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_07_FLEXPWM3_PWMA03                              IMXRT_PADCFG(0,  49, 0xa, 0,  36, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_07_ECAT_TX_EN_0                                 IMXRT_PADCFG(0,  49, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_08_SEMC_DM02                                    IMXRT_PADCFG(0,  50, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_NETC_PINMUX_ETH4_RX_CLK                      IMXRT_PADCFG(0,  50, 0x1, 0, 230, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_08_SAI2_TX_DATA                                 IMXRT_PADCFG(0,  50, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_NETC_PINMUX_ETH0_TX_CLK                      IMXRT_PADCFG(0,  50, 0x3, 0, 213, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_08_GPIO3_IO18                                   IMXRT_PADCFG(0,  50, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_XBAR1_XBAR_INOUT28                           IMXRT_PADCFG(0,  50, 0x6, 0, 306, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_LPSPI3_PCS3                                  IMXRT_PADCFG(0,  50, 0x8, 0,  93, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_NETC_PINMUX_ETH3_TX_CLK                      IMXRT_PADCFG(0,  50, 0x9, 0, 229, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_08_CCM_CLKO2                                    IMXRT_PADCFG(0,  50, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_08_ECAT_TX_CLK_0                                IMXRT_PADCFG(0,  50, 0xc, 0,  17, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_09_SEMC_DATA24                                  IMXRT_PADCFG(0,  51, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_09_NETC_PINMUX_ETH4_RXD03                       IMXRT_PADCFG(0,  51, 0x1, 0, 236, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_09_SAI2_TX_BCLK                                 IMXRT_PADCFG(0,  51, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_09_NETC_PINMUX_ETH0_RXD00                       IMXRT_PADCFG(0,  51, 0x3, 0, 209, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_09_GPIO3_IO19                                   IMXRT_PADCFG(0,  51, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_09_XBAR1_XBAR_INOUT29                           IMXRT_PADCFG(0,  51, 0x6, 0, 307, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_09_LPSPI3_PCS2                                  IMXRT_PADCFG(0,  51, 0x8, 0,  92, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_09_NETC_PINMUX_ETH3_RXD00                       IMXRT_PADCFG(0,  51, 0x9, 0, 225, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_09_QTIMER1_TIMER0                               IMXRT_PADCFG(0,  51, 0xa, 0, 238, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_09_ECAT_RX_DATA0_0                              IMXRT_PADCFG(0,  51, 0xc, 0,   5, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_10_SEMC_DATA25                                  IMXRT_PADCFG(0,  52, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_10_NETC_PINMUX_ETH4_RXD02                       IMXRT_PADCFG(0,  52, 0x1, 0, 235, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_10_SAI2_TX_SYNC                                 IMXRT_PADCFG(0,  52, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_10_NETC_PINMUX_ETH0_RXD01                       IMXRT_PADCFG(0,  52, 0x3, 0, 210, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_10_GPIO3_IO20                                   IMXRT_PADCFG(0,  52, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_10_XBAR1_XBAR_INOUT30                           IMXRT_PADCFG(0,  52, 0x6, 0, 308, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_10_LPSPI3_PCS1                                  IMXRT_PADCFG(0,  52, 0x8, 0,  91, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_10_NETC_PINMUX_ETH3_RXD01                       IMXRT_PADCFG(0,  52, 0x9, 0, 226, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_10_QTIMER1_TIMER1                               IMXRT_PADCFG(0,  52, 0xa, 0, 239, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_10_ECAT_RX_DATA1_0                              IMXRT_PADCFG(0,  52, 0xc, 0,   7, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_11_SEMC_DATA26                                  IMXRT_PADCFG(0,  53, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_NETC_PINMUX_ETH4_TXD03                       IMXRT_PADCFG(0,  53, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_SPDIF_OUT                                    IMXRT_PADCFG(0,  53, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_NETC_PINMUX_ETH0_RX_DV                       IMXRT_PADCFG(0,  53, 0x3, 0, 207, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_11_LPSPI5_PCS3                                  IMXRT_PADCFG(0,  53, 0x4, 0, 104, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_GPIO3_IO21                                   IMXRT_PADCFG(0,  53, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_XBAR1_XBAR_INOUT31                           IMXRT_PADCFG(0,  53, 0x6, 0, 309, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_SAI3_RX_SYNC                                 IMXRT_PADCFG(0,  53, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_NETC_PINMUX_ETH3_RX_DV                       IMXRT_PADCFG(0,  53, 0x9, 0, 223, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_11_QTIMER1_TIMER2                               IMXRT_PADCFG(0,  53, 0xa, 0, 240, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_11_ECAT_RX_DV_0                                 IMXRT_PADCFG(0,  53, 0xc, 0,  13, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_12_SEMC_DATA27                                  IMXRT_PADCFG(0,  54, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_NETC_PINMUX_ETH4_TXD02                       IMXRT_PADCFG(0,  54, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_SPDIF_IN                                     IMXRT_PADCFG(0,  54, 0x2, 0, 282, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_NETC_PINMUX_ETH0_RX_ER                       IMXRT_PADCFG(0,  54, 0x3, 0, 208, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_12_LPSPI5_PCS2                                  IMXRT_PADCFG(0,  54, 0x4, 0, 103, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_GPIO3_IO22                                   IMXRT_PADCFG(0,  54, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_XBAR1_XBAR_INOUT32                           IMXRT_PADCFG(0,  54, 0x6, 0, 310, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_SAI3_RX_BCLK                                 IMXRT_PADCFG(0,  54, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_NETC_PINMUX_ETH3_RX_ER                       IMXRT_PADCFG(0,  54, 0x9, 0, 224, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_12_QTIMER1_TIMER3                               IMXRT_PADCFG(0,  54, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_12_ECAT_PT0_RX_ER                               IMXRT_PADCFG(0,  54, 0xc, 0,  15, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_13_SEMC_DATA28                                  IMXRT_PADCFG(0,  55, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_NETC_PINMUX_ETH4_TXD00                       IMXRT_PADCFG(0,  55, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_LPUART11_TX                                  IMXRT_PADCFG(0,  55, 0x2, 0, 118, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_NETC_PINMUX_ETH0_TXD03                       IMXRT_PADCFG(0,  55, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_LPSPI5_PCS1                                  IMXRT_PADCFG(0,  55, 0x4, 0, 102, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_13_GPIO3_IO23                                   IMXRT_PADCFG(0,  55, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_XBAR1_XBAR_INOUT33                           IMXRT_PADCFG(0,  55, 0x6, 0, 311, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_SAI3_RX_DATA                                 IMXRT_PADCFG(0,  55, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_NETC_PINMUX_ETH3_TXD03                       IMXRT_PADCFG(0,  55, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_13_QTIMER2_TIMER0                               IMXRT_PADCFG(0,  55, 0xa, 0, 241, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_13_ECAT_TX_DATA0_1                              IMXRT_PADCFG(0,  55, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_14_SEMC_DATA29                                  IMXRT_PADCFG(0,  56, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_NETC_PINMUX_ETH4_TXD01                       IMXRT_PADCFG(0,  56, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_LPUART11_RX                                  IMXRT_PADCFG(0,  56, 0x2, 0, 117, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_NETC_PINMUX_ETH0_TXD02                       IMXRT_PADCFG(0,  56, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_LPUART5_DSR_B                                IMXRT_PADCFG(0,  56, 0x4, 0, 125, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_GPIO3_IO24                                   IMXRT_PADCFG(0,  56, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_XBAR1_XBAR_INOUT34                           IMXRT_PADCFG(0,  56, 0x6, 0, 312, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_SAI3_TX_DATA                                 IMXRT_PADCFG(0,  56, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_NETC_PINMUX_ETH3_TXD02                       IMXRT_PADCFG(0,  56, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_14_QTIMER2_TIMER1                               IMXRT_PADCFG(0,  56, 0xa, 0, 242, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_14_ECAT_TX_DATA1_1                              IMXRT_PADCFG(0,  56, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_15_SEMC_DATA30                                  IMXRT_PADCFG(0,  57, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_NETC_PINMUX_ETH4_TX_EN                       IMXRT_PADCFG(0,  57, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_LPUART11_CTS_B                               IMXRT_PADCFG(0,  57, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_NETC_PINMUX_ETH0_RX_CLK                      IMXRT_PADCFG(0,  57, 0x3, 0, 206, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_15_LPUART5_DCD_B                                IMXRT_PADCFG(0,  57, 0x4, 0, 124, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_GPIO3_IO25                                   IMXRT_PADCFG(0,  57, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_XBAR1_XBAR_INOUT35                           IMXRT_PADCFG(0,  57, 0x6, 0, 313, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_SAI3_TX_BCLK                                 IMXRT_PADCFG(0,  57, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_NETC_PINMUX_ETH3_RX_CLK                      IMXRT_PADCFG(0,  57, 0x9, 0, 222, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_15_QTIMER2_TIMER2                               IMXRT_PADCFG(0,  57, 0xa, 0, 243, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_15_ECAT_TX_EN_1                                 IMXRT_PADCFG(0,  57, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_EMC_B2_16_SEMC_DATA31                                  IMXRT_PADCFG(0,  58, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_NETC_PINMUX_ETH4_TX_CLK                      IMXRT_PADCFG(0,  58, 0x1, 0, 237, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_16_LPUART11_RTS_B                               IMXRT_PADCFG(0,  58, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_NETC_PINMUX_ETH0_RXD02                       IMXRT_PADCFG(0,  58, 0x3, 0, 211, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_16_LPUART5_DTR_B                                IMXRT_PADCFG(0,  58, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_GPIO3_IO26                                   IMXRT_PADCFG(0,  58, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_XBAR1_XBAR_INOUT14                           IMXRT_PADCFG(0,  58, 0x6, 0, 293, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_16_SAI3_TX_SYNC                                 IMXRT_PADCFG(0,  58, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_NETC_PINMUX_ETH3_RXD02                       IMXRT_PADCFG(0,  58, 0x9, 0, 227, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_16_QTIMER2_TIMER3                               IMXRT_PADCFG(0,  58, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_16_ECAT_TX_CLK_1                                IMXRT_PADCFG(0,  58, 0xc, 0,  18, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_17_SEMC_DM03                                    IMXRT_PADCFG(0,  59, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_17_NETC_PINMUX_ETH4_RXD00                       IMXRT_PADCFG(0,  59, 0x1, 0, 233, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_17_LPUART5_TX                                   IMXRT_PADCFG(0,  59, 0x2, 0, 128, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B2_17_NETC_PINMUX_ETH0_RXD03                       IMXRT_PADCFG(0,  59, 0x3, 0, 212, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_17_GPIO3_IO27                                   IMXRT_PADCFG(0,  59, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_17_XBAR1_XBAR_INOUT15                           IMXRT_PADCFG(0,  59, 0x6, 0, 294, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_17_SAI3_MCLK                                    IMXRT_PADCFG(0,  59, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_17_NETC_PINMUX_ETH3_RXD03                       IMXRT_PADCFG(0,  59, 0x9, 0, 228, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_17_QTIMER3_TIMER0                               IMXRT_PADCFG(0,  59, 0xa, 0, 244, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_17_ECAT_RX_DATA0_1                              IMXRT_PADCFG(0,  59, 0xc, 0,   6, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_18_SEMC_DQS4                                    IMXRT_PADCFG(0,  60, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_NETC_PINMUX_ETH4_RXD01                       IMXRT_PADCFG(0,  60, 0x1, 0, 234, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_18_LPUART5_RX                                   IMXRT_PADCFG(0,  60, 0x2, 0, 127, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B2_18_NETC_PINMUX_ETH0_TX_ER                       IMXRT_PADCFG(0,  60, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_GPIO3_IO28                                   IMXRT_PADCFG(0,  60, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_XBAR1_XBAR_INOUT16                           IMXRT_PADCFG(0,  60, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_EWM_EWM_OUT_B                                IMXRT_PADCFG(0,  60, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_NETC_PINMUX_ETH3_TX_ER                       IMXRT_PADCFG(0,  60, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_18_QTIMER3_TIMER1                               IMXRT_PADCFG(0,  60, 0xa, 0, 245, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_18_ECAT_RX_DATA1_1                              IMXRT_PADCFG(0,  60, 0xc, 0,   8, 0x1)

