apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_EMC_B2_19_SEMC_CLKX00                                  IMXRT_PADCFG(0,  61, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_NETC_PINMUX_ETH4_RX_DV                       IMXRT_PADCFG(0,  61, 0x1, 0, 231, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_19_LPUART5_CTS_B                                IMXRT_PADCFG(0,  61, 0x2, 0, 123, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_19_NETC_ETH0_CRS                                IMXRT_PADCFG(0,  61, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_NETC_EMDC                                    IMXRT_PADCFG(0,  61, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_GPIO3_IO29                                   IMXRT_PADCFG(0,  61, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_XBAR1_XBAR_INOUT36                           IMXRT_PADCFG(0,  61, 0x6, 0, 314, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_LPI2C3_SCL                                   IMXRT_PADCFG(0,  61, 0x8, 0,  82, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_19_NETC_ETH3_SLV_MDC                            IMXRT_PADCFG(0,  61, 0x9, 0, 197, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B2_19_QTIMER3_TIMER2                               IMXRT_PADCFG(0,  61, 0xa, 0, 246, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_19_ECAT_RX_DV_1                                 IMXRT_PADCFG(0,  61, 0xc, 0,  14, 0x1)

#define IOMUXC_PAD_GPIO_EMC_B2_20_SEMC_CLKX01                                  IMXRT_PADCFG(0,  62, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_NETC_PINMUX_ETH4_RX_ER                       IMXRT_PADCFG(0,  62, 0x1, 0, 232, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_20_LPUART5_RTS_B                                IMXRT_PADCFG(0,  62, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_NETC_ETH0_COL                                IMXRT_PADCFG(0,  62, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_NETC_EMDIO                                   IMXRT_PADCFG(0,  62, 0x4, 0, 190, 0x3)
#define IOMUXC_PAD_GPIO_EMC_B2_20_GPIO3_IO30                                   IMXRT_PADCFG(0,  62, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_XBAR1_XBAR_INOUT37                           IMXRT_PADCFG(0,  62, 0x6, 0, 315, 0x0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_LPI2C3_SDA                                   IMXRT_PADCFG(0,  62, 0x8, 0,  83, 0x1)
#define IOMUXC_PAD_GPIO_EMC_B2_20_NETC_ETH3_SLV_MDIO                           IMXRT_PADCFG(0,  62, 0x9, 0, 198, 0x2)
#define IOMUXC_PAD_GPIO_EMC_B2_20_QTIMER3_TIMER3                               IMXRT_PADCFG(0,  62, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_EMC_B2_20_ECAT_RX_ER_1                                 IMXRT_PADCFG(0,  62, 0xc, 0,  16, 0x1)

#define IOMUXC_PAD_GPIO_AD_00_CAN2_TX                                          IMXRT_PADCFG(0,  63, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_MIC_CLK                                          IMXRT_PADCFG(0,  63, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_GPT2_CAPTURE1                                    IMXRT_PADCFG(0,  63, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_FLEXPWM1_PWMA00                                  IMXRT_PADCFG(0,  63, 0x4, 0,  21, 0x2)
#define IOMUXC_PAD_GPIO_AD_00_GPIO4_IO00                                       IMXRT_PADCFG(0,  63, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_SINC1_MOD_CLK0                                   IMXRT_PADCFG(0,  63, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_FLEXIO2_FLEXIO00                                 IMXRT_PADCFG(0,  63, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_00_QTIMER4_TIMER0                                   IMXRT_PADCFG(0,  63, 0x9, 0, 247, 0x1)

#define IOMUXC_PAD_GPIO_AD_01_CAN2_RX                                          IMXRT_PADCFG(0,  64, 0x1, 0,   1, 0x0)
#define IOMUXC_PAD_GPIO_AD_01_MIC_BITSTREAM00                                  IMXRT_PADCFG(0,  64, 0x2, 0, 140, 0x0)
#define IOMUXC_PAD_GPIO_AD_01_GPT2_CAPTURE2                                    IMXRT_PADCFG(0,  64, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_01_FLEXPWM1_PWMB00                                  IMXRT_PADCFG(0,  64, 0x4, 0,  24, 0x2)
#define IOMUXC_PAD_GPIO_AD_01_GPIO4_IO01                                       IMXRT_PADCFG(0,  64, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_01_SINC1_MOD_CLK1                                   IMXRT_PADCFG(0,  64, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_01_FLEXIO2_FLEXIO01                                 IMXRT_PADCFG(0,  64, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_01_QTIMER4_TIMER1                                   IMXRT_PADCFG(0,  64, 0x9, 0, 248, 0x1)

#define IOMUXC_PAD_GPIO_AD_02_MIC_BITSTREAM01                                  IMXRT_PADCFG(0,  65, 0x2, 0, 141, 0x0)
#define IOMUXC_PAD_GPIO_AD_02_GPT2_COMPARE1                                    IMXRT_PADCFG(0,  65, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_02_FLEXPWM1_PWMA01                                  IMXRT_PADCFG(0,  65, 0x4, 0,  22, 0x1)
#define IOMUXC_PAD_GPIO_AD_02_GPIO4_IO02                                       IMXRT_PADCFG(0,  65, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_02_SINC1_MOD_CLK2                                   IMXRT_PADCFG(0,  65, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_02_FLEXIO2_FLEXIO02                                 IMXRT_PADCFG(0,  65, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_02_QTIMER4_TIMER2                                   IMXRT_PADCFG(0,  65, 0x9, 0, 249, 0x0)

#define IOMUXC_PAD_GPIO_AD_03_MIC_BITSTREAM02                                  IMXRT_PADCFG(0,  66, 0x2, 0, 142, 0x0)
#define IOMUXC_PAD_GPIO_AD_03_GPT2_COMPARE2                                    IMXRT_PADCFG(0,  66, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_03_FLEXPWM1_PWMB01                                  IMXRT_PADCFG(0,  66, 0x4, 0,  25, 0x1)
#define IOMUXC_PAD_GPIO_AD_03_GPIO4_IO03                                       IMXRT_PADCFG(0,  66, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_03_SINC1_EMCLK00                                    IMXRT_PADCFG(0,  66, 0x6, 0, 273, 0x0)
#define IOMUXC_PAD_GPIO_AD_03_FLEXIO2_FLEXIO03                                 IMXRT_PADCFG(0,  66, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_03_QTIMER4_TIMER3                                   IMXRT_PADCFG(0,  66, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_04_MIC_BITSTREAM03                                  IMXRT_PADCFG(0,  67, 0x2, 0, 143, 0x0)
#define IOMUXC_PAD_GPIO_AD_04_GPT2_COMPARE3                                    IMXRT_PADCFG(0,  67, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_04_FLEXPWM1_PWMB02                                  IMXRT_PADCFG(0,  67, 0x4, 0,  26, 0x1)
#define IOMUXC_PAD_GPIO_AD_04_GPIO4_IO04                                       IMXRT_PADCFG(0,  67, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_04_SINC1_EMBIT00                                    IMXRT_PADCFG(0,  67, 0x6, 0, 269, 0x0)
#define IOMUXC_PAD_GPIO_AD_04_FLEXIO2_FLEXIO04                                 IMXRT_PADCFG(0,  67, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_04_QTIMER5_TIMER0                                   IMXRT_PADCFG(0,  67, 0x9, 0, 250, 0x1)

