apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AD_05_GPT2_CLK                                         IMXRT_PADCFG(0,  68, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_05_FLEXPWM1_PWMA02                                  IMXRT_PADCFG(0,  68, 0x4, 0,  23, 0x1)
#define IOMUXC_PAD_GPIO_AD_05_GPIO4_IO05                                       IMXRT_PADCFG(0,  68, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_05_SINC1_EMCLK01                                    IMXRT_PADCFG(0,  68, 0x6, 0, 274, 0x0)
#define IOMUXC_PAD_GPIO_AD_05_CCM_ENET_REF_CLK_25M                             IMXRT_PADCFG(0,  68, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_05_FLEXIO2_FLEXIO05                                 IMXRT_PADCFG(0,  68, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_05_QTIMER5_TIMER1                                   IMXRT_PADCFG(0,  68, 0x9, 0, 251, 0x1)

#define IOMUXC_PAD_GPIO_AD_06_USB_OTG2_OC                                      IMXRT_PADCFG(0,  69, 0x0, 0, 285, 0x0)
#define IOMUXC_PAD_GPIO_AD_06_CAN3_TX                                          IMXRT_PADCFG(0,  69, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_06_FLEXPWM1_PWMX00                                  IMXRT_PADCFG(0,  69, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_06_GPIO4_IO06                                       IMXRT_PADCFG(0,  69, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_06_SINC1_EMBIT01                                    IMXRT_PADCFG(0,  69, 0x6, 0, 270, 0x0)
#define IOMUXC_PAD_GPIO_AD_06_FLEXIO2_FLEXIO06                                 IMXRT_PADCFG(0,  69, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_06_QTIMER5_TIMER2                                   IMXRT_PADCFG(0,  69, 0x9, 0, 252, 0x0)

#define IOMUXC_PAD_GPIO_AD_07_USB_OTG2_PWR                                     IMXRT_PADCFG(0,  70, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_07_CAN3_RX                                          IMXRT_PADCFG(0,  70, 0x1, 0,   2, 0x0)
#define IOMUXC_PAD_GPIO_AD_07_FLEXPWM1_PWMX01                                  IMXRT_PADCFG(0,  70, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_07_GPIO4_IO07                                       IMXRT_PADCFG(0,  70, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_07_SINC1_EMCLK02                                    IMXRT_PADCFG(0,  70, 0x6, 0, 275, 0x0)
#define IOMUXC_PAD_GPIO_AD_07_FLEXIO2_FLEXIO07                                 IMXRT_PADCFG(0,  70, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_07_QTIMER5_TIMER3                                   IMXRT_PADCFG(0,  70, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_08_USBPHY2_OTG_ID                                   IMXRT_PADCFG(0,  71, 0x0, 0, 288, 0x0)
#define IOMUXC_PAD_GPIO_AD_08_LPI2C5_SCL                                       IMXRT_PADCFG(0,  71, 0x1, 0,  86, 0x0)
#define IOMUXC_PAD_GPIO_AD_08_FLEXPWM1_PWMX02                                  IMXRT_PADCFG(0,  71, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_08_GPIO4_IO08                                       IMXRT_PADCFG(0,  71, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_08_SINC1_EMBIT02                                    IMXRT_PADCFG(0,  71, 0x6, 0, 271, 0x0)
#define IOMUXC_PAD_GPIO_AD_08_FLEXIO2_FLEXIO08                                 IMXRT_PADCFG(0,  71, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_08_QTIMER6_TIMER0                                   IMXRT_PADCFG(0,  71, 0x9, 0, 253, 0x1)

#define IOMUXC_PAD_GPIO_AD_09_USBPHY1_OTG_ID                                   IMXRT_PADCFG(0,  72, 0x0, 0, 287, 0x0)
#define IOMUXC_PAD_GPIO_AD_09_LPI2C5_SDA                                       IMXRT_PADCFG(0,  72, 0x1, 0,  87, 0x0)
#define IOMUXC_PAD_GPIO_AD_09_FLEXPWM1_PWMX03                                  IMXRT_PADCFG(0,  72, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_09_GPIO4_IO09                                       IMXRT_PADCFG(0,  72, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_09_SINC1_EMCLK03                                    IMXRT_PADCFG(0,  72, 0x6, 0, 276, 0x0)
#define IOMUXC_PAD_GPIO_AD_09_FLEXIO2_FLEXIO09                                 IMXRT_PADCFG(0,  72, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_09_QTIMER6_TIMER1                                   IMXRT_PADCFG(0,  72, 0x9, 0, 254, 0x1)

#define IOMUXC_PAD_GPIO_AD_10_USB_OTG1_PWR                                     IMXRT_PADCFG(0,  73, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_10_FLEXPWM2_PWMX00                                  IMXRT_PADCFG(0,  73, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_10_GPIO4_IO10                                       IMXRT_PADCFG(0,  73, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_10_SINC1_EMBIT03                                    IMXRT_PADCFG(0,  73, 0x6, 0, 272, 0x0)
#define IOMUXC_PAD_GPIO_AD_10_FLEXIO2_FLEXIO10                                 IMXRT_PADCFG(0,  73, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_10_QTIMER6_TIMER2                                   IMXRT_PADCFG(0,  73, 0x9, 0, 255, 0x0)

#define IOMUXC_PAD_GPIO_AD_11_USB_OTG1_OC                                      IMXRT_PADCFG(0,  74, 0x0, 0, 286, 0x0)
#define IOMUXC_PAD_GPIO_AD_11_FLEXPWM2_PWMX01                                  IMXRT_PADCFG(0,  74, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_11_GPIO4_IO11                                       IMXRT_PADCFG(0,  74, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_11_SINC_FILTER_GLUE1_BREAK                          IMXRT_PADCFG(0,  74, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_11_FLEXIO2_FLEXIO11                                 IMXRT_PADCFG(0,  74, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_11_QTIMER6_TIMER3                                   IMXRT_PADCFG(0,  74, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_12_SPDIF_LOCK                                       IMXRT_PADCFG(0,  75, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_LPI2C5_SCLS                                      IMXRT_PADCFG(0,  75, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_GPT1_CAPTURE1                                    IMXRT_PADCFG(0,  75, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_KPP_ROW07                                        IMXRT_PADCFG(0,  75, 0x3, 0,  81, 0x1)
#define IOMUXC_PAD_GPIO_AD_12_FLEXPWM2_PWMX02                                  IMXRT_PADCFG(0,  75, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_GPIO4_IO12                                       IMXRT_PADCFG(0,  75, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_XBAR1_XBAR_INOUT18                               IMXRT_PADCFG(0,  75, 0x6, 0, 296, 0x0)
#define IOMUXC_PAD_GPIO_AD_12_EWM_EWM_OUT_B                                    IMXRT_PADCFG(0,  75, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_12_FLEXIO2_FLEXIO12                                 IMXRT_PADCFG(0,  75, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_13_SPDIF_SR_CLK                                     IMXRT_PADCFG(0,  76, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_13_LPI2C5_SDAS                                      IMXRT_PADCFG(0,  76, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_13_GPT1_CAPTURE2                                    IMXRT_PADCFG(0,  76, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_13_KPP_COL07                                        IMXRT_PADCFG(0,  76, 0x3, 0,  73, 0x1)
#define IOMUXC_PAD_GPIO_AD_13_FLEXPWM2_PWMX03                                  IMXRT_PADCFG(0,  76, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_13_GPIO4_IO13                                       IMXRT_PADCFG(0,  76, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_13_LPUART3_TX                                       IMXRT_PADCFG(0,  76, 0x6, 0, 121, 0x1)
#define IOMUXC_PAD_GPIO_AD_13_USDHC2_CD_B                                      IMXRT_PADCFG(0,  76, 0x7, 0, 291, 0x1)
#define IOMUXC_PAD_GPIO_AD_13_FLEXIO2_FLEXIO13                                 IMXRT_PADCFG(0,  76, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_14_SPDIF_EXT_CLK                                    IMXRT_PADCFG(0,  77, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_14_LPI2C5_HREQ                                      IMXRT_PADCFG(0,  77, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_14_GPT1_COMPARE1                                    IMXRT_PADCFG(0,  77, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_14_KPP_ROW06                                        IMXRT_PADCFG(0,  77, 0x3, 0,  80, 0x1)
#define IOMUXC_PAD_GPIO_AD_14_FLEXPWM3_PWMX00                                  IMXRT_PADCFG(0,  77, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_14_GPIO4_IO14                                       IMXRT_PADCFG(0,  77, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_14_LPUART3_RX                                       IMXRT_PADCFG(0,  77, 0x6, 0, 120, 0x1)
#define IOMUXC_PAD_GPIO_AD_14_USDHC2_WP                                        IMXRT_PADCFG(0,  77, 0x7, 0, 292, 0x1)
#define IOMUXC_PAD_GPIO_AD_14_FLEXIO2_FLEXIO14                                 IMXRT_PADCFG(0,  77, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_15_SPDIF_IN                                         IMXRT_PADCFG(0,  78, 0x0, 0, 282, 0x1)
#define IOMUXC_PAD_GPIO_AD_15_LPUART10_TX                                      IMXRT_PADCFG(0,  78, 0x1, 0, 116, 0x0)
#define IOMUXC_PAD_GPIO_AD_15_GPT1_COMPARE2                                    IMXRT_PADCFG(0,  78, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_15_KPP_COL06                                        IMXRT_PADCFG(0,  78, 0x3, 0,  72, 0x1)
#define IOMUXC_PAD_GPIO_AD_15_FLEXPWM3_PWMX01                                  IMXRT_PADCFG(0,  78, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_15_GPIO4_IO15                                       IMXRT_PADCFG(0,  78, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_15_LPUART3_CTS_B                                    IMXRT_PADCFG(0,  78, 0x6, 0, 119, 0x1)
#define IOMUXC_PAD_GPIO_AD_15_LPSPI3_PCS1                                      IMXRT_PADCFG(0,  78, 0x7, 0,  91, 0x1)
#define IOMUXC_PAD_GPIO_AD_15_FLEXIO2_FLEXIO15                                 IMXRT_PADCFG(0,  78, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_15_CAN1_TX                                          IMXRT_PADCFG(0,  78, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_15_ECAT_CLK_ECAT_CLK25                              IMXRT_PADCFG(0,  78, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_16_SPDIF_OUT                                        IMXRT_PADCFG(0,  79, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_LPUART10_RX                                      IMXRT_PADCFG(0,  79, 0x1, 0, 115, 0x0)
#define IOMUXC_PAD_GPIO_AD_16_GPT1_COMPARE3                                    IMXRT_PADCFG(0,  79, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_KPP_ROW05                                        IMXRT_PADCFG(0,  79, 0x3, 0,  79, 0x1)
#define IOMUXC_PAD_GPIO_AD_16_FLEXPWM3_PWMX02                                  IMXRT_PADCFG(0,  79, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_GPIO4_IO16                                       IMXRT_PADCFG(0,  79, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_LPUART3_RTS_B                                    IMXRT_PADCFG(0,  79, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_LPSPI3_SCK                                       IMXRT_PADCFG(0,  79, 0x7, 0,  94, 0x1)
#define IOMUXC_PAD_GPIO_AD_16_FLEXIO2_FLEXIO16                                 IMXRT_PADCFG(0,  79, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_16_CAN1_RX                                          IMXRT_PADCFG(0,  79, 0x9, 0,   0, 0x0)
#define IOMUXC_PAD_GPIO_AD_16_ECAT_LINK_0                                      IMXRT_PADCFG(0,  79, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_17_SAI4_MCLK                                        IMXRT_PADCFG(0,  80, 0x0, 0, 260, 0x0)
#define IOMUXC_PAD_GPIO_AD_17_ACMP1_CMPO                                       IMXRT_PADCFG(0,  80, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_GPT1_CLK                                         IMXRT_PADCFG(0,  80, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_KPP_COL05                                        IMXRT_PADCFG(0,  80, 0x3, 0,  71, 0x1)
#define IOMUXC_PAD_GPIO_AD_17_FLEXPWM3_PWMX03                                  IMXRT_PADCFG(0,  80, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_GPIO4_IO17                                       IMXRT_PADCFG(0,  80, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_I3C2_PUR                                         IMXRT_PADCFG(0,  80, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_LPSPI3_PCS0                                      IMXRT_PADCFG(0,  80, 0x7, 0,  90, 0x1)
#define IOMUXC_PAD_GPIO_AD_17_FLEXIO2_FLEXIO17                                 IMXRT_PADCFG(0,  80, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_LPI2C3_HREQ                                      IMXRT_PADCFG(0,  80, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_17_ECAT_LINK_1                                      IMXRT_PADCFG(0,  80, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_18_SAI4_RX_SYNC                                     IMXRT_PADCFG(0,  81, 0x0, 0, 264, 0x0)
#define IOMUXC_PAD_GPIO_AD_18_ACMP2_CMPO                                       IMXRT_PADCFG(0,  81, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_18_LPUART5_RI_B                                     IMXRT_PADCFG(0,  81, 0x2, 0, 126, 0x0)
#define IOMUXC_PAD_GPIO_AD_18_KPP_ROW04                                        IMXRT_PADCFG(0,  81, 0x3, 0,  78, 0x1)
#define IOMUXC_PAD_GPIO_AD_18_FLEXPWM4_PWMX00                                  IMXRT_PADCFG(0,  81, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_18_GPIO4_IO18                                       IMXRT_PADCFG(0,  81, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_18_I3C2_SCL                                         IMXRT_PADCFG(0,  81, 0x6, 0,  64, 0x0)
#define IOMUXC_PAD_GPIO_AD_18_LPSPI3_SDO                                       IMXRT_PADCFG(0,  81, 0x7, 0,  96, 0x1)
#define IOMUXC_PAD_GPIO_AD_18_FLEXIO2_FLEXIO18                                 IMXRT_PADCFG(0,  81, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_18_LPI2C3_SCL                                       IMXRT_PADCFG(0,  81, 0x9, 0,  82, 0x2)
#define IOMUXC_PAD_GPIO_AD_18_ECAT_PROM_CLK                                    IMXRT_PADCFG(0,  81, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_19_SAI4_RX_BCLK                                     IMXRT_PADCFG(0,  82, 0x0, 0, 261, 0x0)
#define IOMUXC_PAD_GPIO_AD_19_ACMP3_CMPO                                       IMXRT_PADCFG(0,  82, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_19_XBAR1_XBAR_INOUT19                               IMXRT_PADCFG(0,  82, 0x2, 0, 297, 0x0)
#define IOMUXC_PAD_GPIO_AD_19_KPP_COL04                                        IMXRT_PADCFG(0,  82, 0x3, 0,  70, 0x1)
#define IOMUXC_PAD_GPIO_AD_19_FLEXPWM4_PWMX01                                  IMXRT_PADCFG(0,  82, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_19_GPIO4_IO19                                       IMXRT_PADCFG(0,  82, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_19_I3C2_SDA                                         IMXRT_PADCFG(0,  82, 0x6, 0,  65, 0x0)
#define IOMUXC_PAD_GPIO_AD_19_LPSPI3_SDI                                       IMXRT_PADCFG(0,  82, 0x7, 0,  95, 0x1)
#define IOMUXC_PAD_GPIO_AD_19_FLEXIO2_FLEXIO19                                 IMXRT_PADCFG(0,  82, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_19_LPI2C3_SDA                                       IMXRT_PADCFG(0,  82, 0x9, 0,  83, 0x2)
#define IOMUXC_PAD_GPIO_AD_19_ECAT_PROM_DATA                                   IMXRT_PADCFG(0,  82, 0xc, 0,  20, 0x0)

