apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AD_20_SAI4_RX_DATA00                                   IMXRT_PADCFG(0,  83, 0x0, 0, 262, 0x0)
#define IOMUXC_PAD_GPIO_AD_20_ACMP4_CMPO                                       IMXRT_PADCFG(0,  83, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_20_LPIT2_TRIGGER00                                  IMXRT_PADCFG(0,  83, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_20_SINC1_EMCLK00                                    IMXRT_PADCFG(0,  83, 0x3, 0, 273, 0x1)
#define IOMUXC_PAD_GPIO_AD_20_FLEXPWM4_PWMX02                                  IMXRT_PADCFG(0,  83, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_20_GPIO4_IO20                                       IMXRT_PADCFG(0,  83, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_20_NETC_TMR_TRIG1                                   IMXRT_PADCFG(0,  83, 0x6, 0, 203, 0x0)
#define IOMUXC_PAD_GPIO_AD_20_NETC_1588_CLK                                    IMXRT_PADCFG(0,  83, 0x7, 0, 205, 0x0)
#define IOMUXC_PAD_GPIO_AD_20_FLEXIO2_FLEXIO20                                 IMXRT_PADCFG(0,  83, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_21_SAI4_TX_DATA00                                   IMXRT_PADCFG(0,  84, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_LPIT2_TRIGGER01                                  IMXRT_PADCFG(0,  84, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_SINC1_EMBIT00                                    IMXRT_PADCFG(0,  84, 0x3, 0, 269, 0x1)
#define IOMUXC_PAD_GPIO_AD_21_FLEXPWM4_PWMX03                                  IMXRT_PADCFG(0,  84, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_GPIO4_IO21                                       IMXRT_PADCFG(0,  84, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_NETC_TMR_TRIG2                                   IMXRT_PADCFG(0,  84, 0x6, 0, 204, 0x0)
#define IOMUXC_PAD_GPIO_AD_21_NETC_TMR_GCLK                                    IMXRT_PADCFG(0,  84, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_FLEXIO2_FLEXIO21                                 IMXRT_PADCFG(0,  84, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_21_ECAT_LED_RUN                                     IMXRT_PADCFG(0,  84, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_22_SAI4_TX_BCLK                                     IMXRT_PADCFG(0,  85, 0x0, 0, 265, 0x0)
#define IOMUXC_PAD_GPIO_AD_22_LPIT2_TRIGGER02                                  IMXRT_PADCFG(0,  85, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_22_SINC1_EMCLK01                                    IMXRT_PADCFG(0,  85, 0x3, 0, 274, 0x1)
#define IOMUXC_PAD_GPIO_AD_22_GPIO4_IO22                                       IMXRT_PADCFG(0,  85, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_22_NETC_TMR_ALARM1                                  IMXRT_PADCFG(0,  85, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_22_FLEXIO2_FLEXIO22                                 IMXRT_PADCFG(0,  85, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_22_ECAT_LED_ERR                                     IMXRT_PADCFG(0,  85, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_23_SAI4_TX_SYNC                                     IMXRT_PADCFG(0,  86, 0x0, 0, 266, 0x0)
#define IOMUXC_PAD_GPIO_AD_23_LPIT2_TRIGGER03                                  IMXRT_PADCFG(0,  86, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_23_SINC1_EMBIT01                                    IMXRT_PADCFG(0,  86, 0x3, 0, 270, 0x1)
#define IOMUXC_PAD_GPIO_AD_23_GPIO4_IO23                                       IMXRT_PADCFG(0,  86, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_23_NETC_TMR_ALARM2                                  IMXRT_PADCFG(0,  86, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_23_FLEXIO2_FLEXIO23                                 IMXRT_PADCFG(0,  86, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_23_ECAT_LED_STATE_RUN                               IMXRT_PADCFG(0,  86, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_24_LPUART6_TX                                       IMXRT_PADCFG(0,  87, 0x0, 0, 134, 0x1)
#define IOMUXC_PAD_GPIO_AD_24_LPI2C4_SCL                                       IMXRT_PADCFG(0,  87, 0x1, 0,  84, 0x0)
#define IOMUXC_PAD_GPIO_AD_24_SINC2_MOD_CLK1                                   IMXRT_PADCFG(0,  87, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_24_FLEXPWM2_PWMA00                                  IMXRT_PADCFG(0,  87, 0x4, 0,  27, 0x1)
#define IOMUXC_PAD_GPIO_AD_24_GPIO4_IO24                                       IMXRT_PADCFG(0,  87, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_24_NETC_TMR_TRIG1                                   IMXRT_PADCFG(0,  87, 0x7, 0, 203, 0x1)
#define IOMUXC_PAD_GPIO_AD_24_FLEXIO2_FLEXIO24                                 IMXRT_PADCFG(0,  87, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_24_ECAT_LINK_ACT00                                  IMXRT_PADCFG(0,  87, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_25_LPUART6_RX                                       IMXRT_PADCFG(0,  88, 0x0, 0, 133, 0x1)
#define IOMUXC_PAD_GPIO_AD_25_LPI2C4_SDA                                       IMXRT_PADCFG(0,  88, 0x1, 0,  85, 0x0)
#define IOMUXC_PAD_GPIO_AD_25_LPSPI5_PCS3                                      IMXRT_PADCFG(0,  88, 0x2, 0, 104, 0x1)
#define IOMUXC_PAD_GPIO_AD_25_SINC2_MOD_CLK2                                   IMXRT_PADCFG(0,  88, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_25_FLEXPWM2_PWMB00                                  IMXRT_PADCFG(0,  88, 0x4, 0,  30, 0x1)
#define IOMUXC_PAD_GPIO_AD_25_GPIO4_IO25                                       IMXRT_PADCFG(0,  88, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_25_NETC_TMR_TRIG2                                   IMXRT_PADCFG(0,  88, 0x7, 0, 204, 0x1)
#define IOMUXC_PAD_GPIO_AD_25_FLEXIO2_FLEXIO25                                 IMXRT_PADCFG(0,  88, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_25_ECAT_LINK_ACT01                                  IMXRT_PADCFG(0,  88, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_26_LPUART6_CTS_B                                    IMXRT_PADCFG(0,  89, 0x0, 0, 129, 0x1)
#define IOMUXC_PAD_GPIO_AD_26_LPUART5_TX                                       IMXRT_PADCFG(0,  89, 0x1, 0, 128, 0x3)
#define IOMUXC_PAD_GPIO_AD_26_LPSPI5_PCS2                                      IMXRT_PADCFG(0,  89, 0x2, 0, 103, 0x1)
#define IOMUXC_PAD_GPIO_AD_26_SINC2_EMCLK00                                    IMXRT_PADCFG(0,  89, 0x3, 0, 279, 0x0)
#define IOMUXC_PAD_GPIO_AD_26_FLEXPWM2_PWMA01                                  IMXRT_PADCFG(0,  89, 0x4, 0,  28, 0x1)
#define IOMUXC_PAD_GPIO_AD_26_GPIO4_IO26                                       IMXRT_PADCFG(0,  89, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_26_KPP_ROW00                                        IMXRT_PADCFG(0,  89, 0x6, 0,  74, 0x1)
#define IOMUXC_PAD_GPIO_AD_26_NETC_TMR_PP1                                     IMXRT_PADCFG(0,  89, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_26_FLEXIO2_FLEXIO26                                 IMXRT_PADCFG(0,  89, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_26_USDHC2_CD_B                                      IMXRT_PADCFG(0,  89, 0x9, 0, 291, 0x2)
#define IOMUXC_PAD_GPIO_AD_26_MIC_BITSTREAM02                                  IMXRT_PADCFG(0,  89, 0xc, 0, 142, 0x1)

#define IOMUXC_PAD_GPIO_AD_27_LPUART6_RTS_B                                    IMXRT_PADCFG(0,  90, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_27_LPUART5_RX                                       IMXRT_PADCFG(0,  90, 0x1, 0, 127, 0x3)
#define IOMUXC_PAD_GPIO_AD_27_LPSPI5_PCS1                                      IMXRT_PADCFG(0,  90, 0x2, 0, 102, 0x2)
#define IOMUXC_PAD_GPIO_AD_27_SINC2_EMBIT00                                    IMXRT_PADCFG(0,  90, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_27_FLEXPWM2_PWMB01                                  IMXRT_PADCFG(0,  90, 0x4, 0,  31, 0x1)
#define IOMUXC_PAD_GPIO_AD_27_GPIO4_IO27                                       IMXRT_PADCFG(0,  90, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_27_KPP_COL00                                        IMXRT_PADCFG(0,  90, 0x6, 0,  66, 0x1)
#define IOMUXC_PAD_GPIO_AD_27_NETC_TMR_PP2                                     IMXRT_PADCFG(0,  90, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_27_FLEXIO2_FLEXIO27                                 IMXRT_PADCFG(0,  90, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_27_USDHC2_WP                                        IMXRT_PADCFG(0,  90, 0x9, 0, 292, 0x2)
#define IOMUXC_PAD_GPIO_AD_27_MIC_CLK                                          IMXRT_PADCFG(0,  90, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_28_LPSPI5_SCK                                       IMXRT_PADCFG(0,  91, 0x0, 0, 105, 0x2)
#define IOMUXC_PAD_GPIO_AD_28_I3C1_PUR                                         IMXRT_PADCFG(0,  91, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_SINC2_EMCLK01                                    IMXRT_PADCFG(0,  91, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_FLEXPWM2_PWMB02                                  IMXRT_PADCFG(0,  91, 0x4, 0,  32, 0x1)
#define IOMUXC_PAD_GPIO_AD_28_GPIO4_IO28                                       IMXRT_PADCFG(0,  91, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_KPP_ROW03                                        IMXRT_PADCFG(0,  91, 0x6, 0,  77, 0x1)
#define IOMUXC_PAD_GPIO_AD_28_NETC_TMR_PP3                                     IMXRT_PADCFG(0,  91, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_FLEXIO2_FLEXIO28                                 IMXRT_PADCFG(0,  91, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_USDHC2_RESET_B                                   IMXRT_PADCFG(0,  91, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_28_MIC_BITSTREAM00                                  IMXRT_PADCFG(0,  91, 0xc, 0, 140, 0x1)

#define IOMUXC_PAD_GPIO_AD_29_LPSPI5_PCS0                                      IMXRT_PADCFG(0,  92, 0x0, 0, 101, 0x2)
#define IOMUXC_PAD_GPIO_AD_29_USDHC2_CD_B                                      IMXRT_PADCFG(0,  92, 0x2, 0, 291, 0x3)
#define IOMUXC_PAD_GPIO_AD_29_SINC2_EMBIT01                                    IMXRT_PADCFG(0,  92, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_29_FLEXPWM2_PWMA02                                  IMXRT_PADCFG(0,  92, 0x4, 0,  29, 0x1)
#define IOMUXC_PAD_GPIO_AD_29_GPIO4_IO29                                       IMXRT_PADCFG(0,  92, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_29_KPP_COL03                                        IMXRT_PADCFG(0,  92, 0x6, 0,  69, 0x1)
#define IOMUXC_PAD_GPIO_AD_29_EWM_EWM_OUT_B                                    IMXRT_PADCFG(0,  92, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_29_FLEXIO2_FLEXIO29                                 IMXRT_PADCFG(0,  92, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_29_USDHC2_VSELECT                                   IMXRT_PADCFG(0,  92, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_29_MIC_BITSTREAM01                                  IMXRT_PADCFG(0,  92, 0xc, 0, 141, 0x1)

#define IOMUXC_PAD_GPIO_AD_30_LPSPI5_SDO                                       IMXRT_PADCFG(0,  93, 0x0, 0, 107, 0x2)
#define IOMUXC_PAD_GPIO_AD_30_USB_OTG2_OC                                      IMXRT_PADCFG(0,  93, 0x1, 0, 285, 0x1)
#define IOMUXC_PAD_GPIO_AD_30_CAN2_TX                                          IMXRT_PADCFG(0,  93, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_30_SINC2_EMCLK02                                    IMXRT_PADCFG(0,  93, 0x3, 0, 280, 0x0)
#define IOMUXC_PAD_GPIO_AD_30_LPUART8_TX                                       IMXRT_PADCFG(0,  93, 0x4, 0, 137, 0x0)
#define IOMUXC_PAD_GPIO_AD_30_GPIO4_IO30                                       IMXRT_PADCFG(0,  93, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_30_KPP_ROW02                                        IMXRT_PADCFG(0,  93, 0x6, 0,  76, 0x1)
#define IOMUXC_PAD_GPIO_AD_30_NETC_EMDC                                        IMXRT_PADCFG(0,  93, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_30_FLEXIO2_FLEXIO30                                 IMXRT_PADCFG(0,  93, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_30_XBAR1_XBAR_INOUT24                               IMXRT_PADCFG(0,  93, 0x9, 0, 302, 0x1)
#define IOMUXC_PAD_GPIO_AD_30_ECAT_MCLK                                        IMXRT_PADCFG(0,  93, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_31_LPSPI5_SDI                                       IMXRT_PADCFG(0,  94, 0x0, 0, 106, 0x2)
#define IOMUXC_PAD_GPIO_AD_31_USB_OTG2_PWR                                     IMXRT_PADCFG(0,  94, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_31_CAN2_RX                                          IMXRT_PADCFG(0,  94, 0x2, 0,   1, 0x1)
#define IOMUXC_PAD_GPIO_AD_31_SINC2_EMBIT02                                    IMXRT_PADCFG(0,  94, 0x3, 0, 277, 0x0)
#define IOMUXC_PAD_GPIO_AD_31_LPUART8_RX                                       IMXRT_PADCFG(0,  94, 0x4, 0, 136, 0x0)
#define IOMUXC_PAD_GPIO_AD_31_GPIO4_IO31                                       IMXRT_PADCFG(0,  94, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_31_KPP_COL02                                        IMXRT_PADCFG(0,  94, 0x6, 0,  68, 0x1)
#define IOMUXC_PAD_GPIO_AD_31_NETC_EMDIO                                       IMXRT_PADCFG(0,  94, 0x7, 0, 190, 0x4)
#define IOMUXC_PAD_GPIO_AD_31_FLEXIO2_FLEXIO31                                 IMXRT_PADCFG(0,  94, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_31_XBAR1_XBAR_INOUT25                               IMXRT_PADCFG(0,  94, 0x9, 0, 303, 0x1)
#define IOMUXC_PAD_GPIO_AD_31_ECAT_MDIO                                        IMXRT_PADCFG(0,  94, 0xc, 0,  19, 0x0)

