apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AD_32_LPI2C5_SCL                                       IMXRT_PADCFG(0,  95, 0x0, 0,  86, 0x1)
#define IOMUXC_PAD_GPIO_AD_32_USBPHY2_OTG_ID                                   IMXRT_PADCFG(0,  95, 0x1, 0, 288, 0x1)
#define IOMUXC_PAD_GPIO_AD_32_GPC_PMIC_RDY                                     IMXRT_PADCFG(0,  95, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_32_SINC2_EMCLK03                                    IMXRT_PADCFG(0,  95, 0x3, 0, 281, 0x0)
#define IOMUXC_PAD_GPIO_AD_32_USDHC1_CD_B                                      IMXRT_PADCFG(0,  95, 0x4, 0, 289, 0x0)
#define IOMUXC_PAD_GPIO_AD_32_GPIO5_IO00                                       IMXRT_PADCFG(0,  95, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_32_KPP_ROW01                                        IMXRT_PADCFG(0,  95, 0x6, 0,  75, 0x1)
#define IOMUXC_PAD_GPIO_AD_32_NETC_TMR_TRIG1                                   IMXRT_PADCFG(0,  95, 0x7, 0, 203, 0x2)
#define IOMUXC_PAD_GPIO_AD_32_LPUART10_TX                                      IMXRT_PADCFG(0,  95, 0x8, 0, 116, 0x1)
#define IOMUXC_PAD_GPIO_AD_32_MIC_BITSTREAM03                                  IMXRT_PADCFG(0,  95, 0xc, 0, 143, 0x1)

#define IOMUXC_PAD_GPIO_AD_33_LPI2C5_SDA                                       IMXRT_PADCFG(0,  96, 0x0, 0,  87, 0x1)
#define IOMUXC_PAD_GPIO_AD_33_USBPHY1_OTG_ID                                   IMXRT_PADCFG(0,  96, 0x1, 0, 287, 0x1)
#define IOMUXC_PAD_GPIO_AD_33_XBAR1_XBAR_INOUT17                               IMXRT_PADCFG(0,  96, 0x2, 0, 295, 0x0)
#define IOMUXC_PAD_GPIO_AD_33_SINC2_EMBIT03                                    IMXRT_PADCFG(0,  96, 0x3, 0, 278, 0x0)
#define IOMUXC_PAD_GPIO_AD_33_USDHC1_WP                                        IMXRT_PADCFG(0,  96, 0x4, 0, 290, 0x0)
#define IOMUXC_PAD_GPIO_AD_33_GPIO5_IO01                                       IMXRT_PADCFG(0,  96, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_33_KPP_COL01                                        IMXRT_PADCFG(0,  96, 0x6, 0,  67, 0x1)
#define IOMUXC_PAD_GPIO_AD_33_NETC_TMR_TRIG2                                   IMXRT_PADCFG(0,  96, 0x7, 0, 204, 0x2)
#define IOMUXC_PAD_GPIO_AD_33_LPUART10_RX                                      IMXRT_PADCFG(0,  96, 0x8, 0, 115, 0x1)

#define IOMUXC_PAD_GPIO_AD_34_I3C2_SCL                                         IMXRT_PADCFG(0,  97, 0x0, 0,  64, 0x1)
#define IOMUXC_PAD_GPIO_AD_34_USB_OTG1_PWR                                     IMXRT_PADCFG(0,  97, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_34_XBAR1_XBAR_INOUT18                               IMXRT_PADCFG(0,  97, 0x2, 0, 296, 0x1)
#define IOMUXC_PAD_GPIO_AD_34_SINC_FILTER_GLUE2_BREAK                          IMXRT_PADCFG(0,  97, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_34_USDHC1_VSELECT                                   IMXRT_PADCFG(0,  97, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_34_GPIO5_IO02                                       IMXRT_PADCFG(0,  97, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_34_NETC_TMR_ALARM1                                  IMXRT_PADCFG(0,  97, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_34_LPUART10_CTS_B                                   IMXRT_PADCFG(0,  97, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AD_35_I3C2_SDA                                         IMXRT_PADCFG(0,  98, 0x0, 0,  65, 0x1)
#define IOMUXC_PAD_GPIO_AD_35_USB_OTG1_OC                                      IMXRT_PADCFG(0,  98, 0x1, 0, 286, 0x1)
#define IOMUXC_PAD_GPIO_AD_35_XBAR1_XBAR_INOUT19                               IMXRT_PADCFG(0,  98, 0x2, 0, 297, 0x1)
#define IOMUXC_PAD_GPIO_AD_35_SINC2_MOD_CLK0                                   IMXRT_PADCFG(0,  98, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_35_USDHC1_RESET_B                                   IMXRT_PADCFG(0,  98, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_35_GPIO5_IO03                                       IMXRT_PADCFG(0,  98, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_35_NETC_TMR_ALARM2                                  IMXRT_PADCFG(0,  98, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AD_35_LPUART10_RTS_B                                   IMXRT_PADCFG(0,  98, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B1_00_USDHC1_CMD                                    IMXRT_PADCFG(0,  99, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_00_SINC1_EMCLK02                                 IMXRT_PADCFG(0,  99, 0x1, 0, 275, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_00_XBAR1_XBAR_INOUT20                            IMXRT_PADCFG(0,  99, 0x2, 0, 298, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_00_LPTMR2_ALT1                                   IMXRT_PADCFG(0,  99, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_00_XSPI_SLV_CS                                   IMXRT_PADCFG(0,  99, 0x4, 0, 344, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_00_GPIO5_IO04                                    IMXRT_PADCFG(0,  99, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_00_LPSPI3_PCS0                                   IMXRT_PADCFG(0,  99, 0x6, 0,  90, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_00_KPP_ROW07                                     IMXRT_PADCFG(0,  99, 0x8, 0,  81, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_00_CCM_CLKO1                                     IMXRT_PADCFG(0,  99, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B1_01_USDHC1_CLK                                    IMXRT_PADCFG(0, 100, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_01_SINC1_EMBIT02                                 IMXRT_PADCFG(0, 100, 0x1, 0, 271, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_01_XBAR1_XBAR_INOUT21                            IMXRT_PADCFG(0, 100, 0x2, 0, 299, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_01_LPTMR2_ALT2                                   IMXRT_PADCFG(0, 100, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_01_XSPI_SLV_CLK                                  IMXRT_PADCFG(0, 100, 0x4, 0, 354, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_01_GPIO5_IO05                                    IMXRT_PADCFG(0, 100, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_01_LPSPI3_SCK                                    IMXRT_PADCFG(0, 100, 0x6, 0,  94, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_01_KPP_COL07                                     IMXRT_PADCFG(0, 100, 0x8, 0,  73, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_01_CCM_CLKO2                                     IMXRT_PADCFG(0, 100, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B1_02_USDHC1_DATA0                                  IMXRT_PADCFG(0, 101, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_02_SINC1_EMCLK03                                 IMXRT_PADCFG(0, 101, 0x1, 0, 276, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_02_XBAR1_XBAR_INOUT22                            IMXRT_PADCFG(0, 101, 0x2, 0, 300, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_02_LPTMR2_ALT3                                   IMXRT_PADCFG(0, 101, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_02_XSPI_SLV_DATA04                               IMXRT_PADCFG(0, 101, 0x4, 0, 350, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_02_GPIO5_IO06                                    IMXRT_PADCFG(0, 101, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_02_LPSPI3_SDO                                    IMXRT_PADCFG(0, 101, 0x6, 0,  96, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_02_KPP_ROW06                                     IMXRT_PADCFG(0, 101, 0x8, 0,  80, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_02_FLEXSPI1_BUS2BIT_A_SS1_B                      IMXRT_PADCFG(0, 101, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_02_ECAT_RESET_OUT                                IMXRT_PADCFG(0, 101, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B1_03_USDHC1_DATA1                                  IMXRT_PADCFG(0, 102, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_03_SINC1_EMBIT03                                 IMXRT_PADCFG(0, 102, 0x1, 0, 272, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_03_XBAR1_XBAR_INOUT23                            IMXRT_PADCFG(0, 102, 0x2, 0, 301, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_03_LPTMR3_ALT1                                   IMXRT_PADCFG(0, 102, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_03_XSPI_SLV_DATA05                               IMXRT_PADCFG(0, 102, 0x4, 0, 351, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_03_GPIO5_IO07                                    IMXRT_PADCFG(0, 102, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_03_LPSPI3_SDI                                    IMXRT_PADCFG(0, 102, 0x6, 0,  95, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_03_KPP_COL06                                     IMXRT_PADCFG(0, 102, 0x8, 0,  72, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_03_FLEXSPI1_BUS2BIT_B_SS1_B                      IMXRT_PADCFG(0, 102, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B1_04_USDHC1_DATA2                                  IMXRT_PADCFG(0, 103, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_04_SINC_FILTER_GLUE1_BREAK                       IMXRT_PADCFG(0, 103, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_04_SINC2_EMCLK02                                 IMXRT_PADCFG(0, 103, 0x2, 0, 280, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_04_LPTMR3_ALT2                                   IMXRT_PADCFG(0, 103, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_04_XSPI_SLV_DATA06                               IMXRT_PADCFG(0, 103, 0x4, 0, 352, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_04_GPIO5_IO08                                    IMXRT_PADCFG(0, 103, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_04_LPSPI3_PCS1                                   IMXRT_PADCFG(0, 103, 0x6, 0,  91, 0x2)
#define IOMUXC_PAD_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B                      IMXRT_PADCFG(0, 103, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_04_FLEXSPI1_BUS2BIT_A_SS1_B                      IMXRT_PADCFG(0, 103, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

