apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_SD_B1_05_USDHC1_DATA3                                  IMXRT_PADCFG(0, 104, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_05_SINC2_EMBIT02                                 IMXRT_PADCFG(0, 104, 0x2, 0, 277, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_05_LPTMR3_ALT3                                   IMXRT_PADCFG(0, 104, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_05_XSPI_SLV_DATA07                               IMXRT_PADCFG(0, 104, 0x4, 0, 353, 0x0)
#define IOMUXC_PAD_GPIO_SD_B1_05_GPIO5_IO09                                    IMXRT_PADCFG(0, 104, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B1_05_LPSPI3_PCS2                                   IMXRT_PADCFG(0, 104, 0x6, 0,  92, 0x1)
#define IOMUXC_PAD_GPIO_SD_B1_05_FLEXSPI1_BUS2BIT_B_SS0_B                      IMXRT_PADCFG(0, 104, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_00_USDHC2_DATA3                                  IMXRT_PADCFG(0, 105, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_00_FLEXSPI1_BUS2BIT_B_DATA04                     IMXRT_PADCFG(0, 105, 0x1, 0,  47, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_00_XSPI_SLV_DATA04                               IMXRT_PADCFG(0, 105, 0x2, 0, 350, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_00_XBAR1_XBAR_INOUT17                            IMXRT_PADCFG(0, 105, 0x3, 0, 295, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_00_KPP_ROW01                                     IMXRT_PADCFG(0, 105, 0x4, 0,  75, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_00_GPIO5_IO10                                    IMXRT_PADCFG(0, 105, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_00_LPSPI3_PCS3                                   IMXRT_PADCFG(0, 105, 0x6, 0,  93, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_00_NETC_1588_CLK                                 IMXRT_PADCFG(0, 105, 0x8, 0, 205, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_00_LPUART8_TX                                    IMXRT_PADCFG(0, 105, 0x9, 0, 137, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_00_MIC_BITSTREAM00                               IMXRT_PADCFG(0, 105, 0xc, 0, 140, 0x2)

#define IOMUXC_PAD_GPIO_SD_B2_01_USDHC2_DATA2                                  IMXRT_PADCFG(0, 106, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_01_FLEXSPI1_BUS2BIT_B_DATA05                     IMXRT_PADCFG(0, 106, 0x1, 0,  48, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_01_XSPI_SLV_DATA05                               IMXRT_PADCFG(0, 106, 0x2, 0, 351, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_01_QTIMER6_TIMER0                                IMXRT_PADCFG(0, 106, 0x3, 0, 253, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_01_KPP_COL01                                     IMXRT_PADCFG(0, 106, 0x4, 0,  67, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_01_GPIO5_IO11                                    IMXRT_PADCFG(0, 106, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_01_NETC_TMR_GCLK                                 IMXRT_PADCFG(0, 106, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_01_LPUART8_RX                                    IMXRT_PADCFG(0, 106, 0x9, 0, 136, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_01_MIC_BITSTREAM01                               IMXRT_PADCFG(0, 106, 0xc, 0, 141, 0x2)

#define IOMUXC_PAD_GPIO_SD_B2_02_USDHC2_DATA1                                  IMXRT_PADCFG(0, 107, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_02_FLEXSPI1_BUS2BIT_B_DATA06                     IMXRT_PADCFG(0, 107, 0x1, 0,  49, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_02_XSPI_SLV_DATA06                               IMXRT_PADCFG(0, 107, 0x2, 0, 352, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_02_QTIMER6_TIMER1                                IMXRT_PADCFG(0, 107, 0x3, 0, 254, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_02_KPP_ROW00                                     IMXRT_PADCFG(0, 107, 0x4, 0,  74, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_02_GPIO5_IO12                                    IMXRT_PADCFG(0, 107, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_02_NETC_TMR_ALARM1                               IMXRT_PADCFG(0, 107, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_02_LPUART8_CTS_B                                 IMXRT_PADCFG(0, 107, 0x9, 0, 135, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_02_MIC_BITSTREAM02                               IMXRT_PADCFG(0, 107, 0xc, 0, 142, 0x2)

#define IOMUXC_PAD_GPIO_SD_B2_03_USDHC2_DATA0                                  IMXRT_PADCFG(0, 108, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_03_FLEXSPI1_BUS2BIT_B_DATA07                     IMXRT_PADCFG(0, 108, 0x1, 0,  50, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_03_XSPI_SLV_DATA07                               IMXRT_PADCFG(0, 108, 0x2, 0, 353, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_03_QTIMER6_TIMER2                                IMXRT_PADCFG(0, 108, 0x3, 0, 255, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_03_KPP_COL00                                     IMXRT_PADCFG(0, 108, 0x4, 0,  66, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_03_GPIO5_IO13                                    IMXRT_PADCFG(0, 108, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_03_NETC_TMR_ALARM2                               IMXRT_PADCFG(0, 108, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_03_LPUART8_RTS_B                                 IMXRT_PADCFG(0, 108, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_03_MIC_BITSTREAM03                               IMXRT_PADCFG(0, 108, 0xc, 0, 143, 0x2)

#define IOMUXC_PAD_GPIO_SD_B2_04_USDHC2_CLK                                    IMXRT_PADCFG(0, 109, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_04_FLEXSPI1_BUS2BIT_B_SS1_B                      IMXRT_PADCFG(0, 109, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_04_QTIMER7_TIMER0                                IMXRT_PADCFG(0, 109, 0x3, 0, 256, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_04_KPP_ROW03                                     IMXRT_PADCFG(0, 109, 0x4, 0,  77, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_04_GPIO5_IO14                                    IMXRT_PADCFG(0, 109, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_04_LPUART5_RI_B                                  IMXRT_PADCFG(0, 109, 0x6, 0, 126, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_04_NETC_TMR_PP1                                  IMXRT_PADCFG(0, 109, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_04_MIC_CLK                                       IMXRT_PADCFG(0, 109, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_05_USDHC2_CMD                                    IMXRT_PADCFG(0, 110, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_05_FLEXSPI1_BUS2BIT_B_DQS                        IMXRT_PADCFG(0, 110, 0x1, 0,  42, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_05_XSPI_SLV_DQS                                  IMXRT_PADCFG(0, 110, 0x2, 0, 345, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_05_QTIMER7_TIMER1                                IMXRT_PADCFG(0, 110, 0x3, 0, 257, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_05_LPSPI4_PCS3                                   IMXRT_PADCFG(0, 110, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_05_GPIO5_IO15                                    IMXRT_PADCFG(0, 110, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_05_LPUART5_DTR_B                                 IMXRT_PADCFG(0, 110, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_05_NETC_TMR_PP2                                  IMXRT_PADCFG(0, 110, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_06_USDHC2_RESET_B                                IMXRT_PADCFG(0, 111, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_06_FLEXSPI1_BUS2BIT_B_SS0_B                      IMXRT_PADCFG(0, 111, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_06_XSPI_SLV_CS                                   IMXRT_PADCFG(0, 111, 0x2, 0, 344, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_06_QTIMER7_TIMER2                                IMXRT_PADCFG(0, 111, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_06_LPSPI4_PCS2                                   IMXRT_PADCFG(0, 111, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_06_GPIO5_IO16                                    IMXRT_PADCFG(0, 111, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_06_LPUART5_CTS_B                                 IMXRT_PADCFG(0, 111, 0x6, 0, 123, 0x2)
#define IOMUXC_PAD_GPIO_SD_B2_06_NETC_TMR_PP3                                  IMXRT_PADCFG(0, 111, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_07_USDHC2_STROBE                                 IMXRT_PADCFG(0, 112, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_07_FLEXSPI1_BUS2BIT_B_SCLK                       IMXRT_PADCFG(0, 112, 0x1, 0,  51, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_07_XSPI_SLV_CLK                                  IMXRT_PADCFG(0, 112, 0x2, 0, 354, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_07_QTIMER7_TIMER3                                IMXRT_PADCFG(0, 112, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_07_LPSPI4_PCS1                                   IMXRT_PADCFG(0, 112, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_07_GPIO5_IO17                                    IMXRT_PADCFG(0, 112, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_07_LPUART5_RTS_B                                 IMXRT_PADCFG(0, 112, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_07_NETC_TMR_ALARM1                               IMXRT_PADCFG(0, 112, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_08_USDHC2_DATA4                                  IMXRT_PADCFG(0, 113, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_08_FLEXSPI1_BUS2BIT_B_DATA00                     IMXRT_PADCFG(0, 113, 0x1, 0,  43, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_08_XSPI_SLV_DATA00                               IMXRT_PADCFG(0, 113, 0x2, 0, 346, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_08_QTIMER8_TIMER0                                IMXRT_PADCFG(0, 113, 0x3, 0, 258, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_08_LPSPI4_SCK                                    IMXRT_PADCFG(0, 113, 0x4, 0,  98, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_08_GPIO5_IO18                                    IMXRT_PADCFG(0, 113, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_08_LPUART5_TX                                    IMXRT_PADCFG(0, 113, 0x6, 0, 128, 0x4)
#define IOMUXC_PAD_GPIO_SD_B2_08_NETC_TMR_ALARM2                               IMXRT_PADCFG(0, 113, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_08_NETC_TMR_PP2                                  IMXRT_PADCFG(0, 113, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_09_USDHC2_DATA5                                  IMXRT_PADCFG(0, 114, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_09_FLEXSPI1_BUS2BIT_B_DATA01                     IMXRT_PADCFG(0, 114, 0x1, 0,  44, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_09_XSPI_SLV_DATA01                               IMXRT_PADCFG(0, 114, 0x2, 0, 347, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_09_QTIMER8_TIMER1                                IMXRT_PADCFG(0, 114, 0x3, 0, 259, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_09_LPSPI4_PCS0                                   IMXRT_PADCFG(0, 114, 0x4, 0,  97, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_09_GPIO5_IO19                                    IMXRT_PADCFG(0, 114, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_09_LPUART5_RX                                    IMXRT_PADCFG(0, 114, 0x6, 0, 127, 0x4)
#define IOMUXC_PAD_GPIO_SD_B2_09_NETC_TMR_PP1                                  IMXRT_PADCFG(0, 114, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

