apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_SD_B2_10_USDHC2_DATA6                                  IMXRT_PADCFG(0, 115, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_10_FLEXSPI1_BUS2BIT_B_DATA02                     IMXRT_PADCFG(0, 115, 0x1, 0,  45, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_10_XSPI_SLV_DATA02                               IMXRT_PADCFG(0, 115, 0x2, 0, 348, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_10_QTIMER8_TIMER2                                IMXRT_PADCFG(0, 115, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_10_LPSPI4_SDO                                    IMXRT_PADCFG(0, 115, 0x4, 0, 100, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_10_GPIO5_IO20                                    IMXRT_PADCFG(0, 115, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_10_LPUART5_DCD_B                                 IMXRT_PADCFG(0, 115, 0x6, 0, 124, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_10_NETC_TMR_TRIG2                                IMXRT_PADCFG(0, 115, 0x8, 0, 204, 0x3)
#define IOMUXC_PAD_GPIO_SD_B2_10_NETC_TMR_PP3                                  IMXRT_PADCFG(0, 115, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_10_NETC_EMDIO                                    IMXRT_PADCFG(0, 115, 0xa, 0, 190, 0x5)
#define IOMUXC_PAD_GPIO_SD_B2_10_ECAT_MDIO                                     IMXRT_PADCFG(0, 115, 0xc, 0,  19, 0x1)

#define IOMUXC_PAD_GPIO_SD_B2_11_USDHC2_DATA7                                  IMXRT_PADCFG(0, 116, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_11_FLEXSPI1_BUS2BIT_B_DATA03                     IMXRT_PADCFG(0, 116, 0x1, 0,  46, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_11_XSPI_SLV_DATA03                               IMXRT_PADCFG(0, 116, 0x2, 0, 349, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_11_QTIMER8_TIMER3                                IMXRT_PADCFG(0, 116, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_11_LPSPI4_SDI                                    IMXRT_PADCFG(0, 116, 0x4, 0,  99, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_11_GPIO5_IO21                                    IMXRT_PADCFG(0, 116, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_11_LPUART5_DSR_B                                 IMXRT_PADCFG(0, 116, 0x6, 0, 125, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_11_SFA_ATX_CLK_OUT                               IMXRT_PADCFG(0, 116, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_11_NETC_TMR_TRIG1                                IMXRT_PADCFG(0, 116, 0x8, 0, 203, 0x3)
#define IOMUXC_PAD_GPIO_SD_B2_11_NETC_EMDC                                     IMXRT_PADCFG(0, 116, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_SD_B2_11_ECAT_MCLK                                     IMXRT_PADCFG(0, 116, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_A_DQS                  IMXRT_PADCFG(0, 117, 0x0, 0,  41, 0x0)
#define IOMUXC_PAD_GPIO_SD_B2_12_DUMMY_FLEXSPI1_BUS2BIT_B_DQS                  IMXRT_PADCFG(0, 117, 0x1, 0,  42, 0x1)
#define IOMUXC_PAD_GPIO_SD_B2_12_DUMMY_GPIO5_IO22                              IMXRT_PADCFG(0, 117, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_00_NETC_PINMUX_ETH1_TXD00                           IMXRT_PADCFG(0, 118, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_00_ADC2_CONV_D00                                    IMXRT_PADCFG(0, 118, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_00_SEMC_CSX01                                       IMXRT_PADCFG(0, 118, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_00_QTIMER1_TIMER0                                   IMXRT_PADCFG(0, 118, 0x3, 0, 238, 0x2)
#define IOMUXC_PAD_GPIO_B1_00_XBAR1_XBAR_INOUT26                               IMXRT_PADCFG(0, 118, 0x4, 0, 304, 0x1)
#define IOMUXC_PAD_GPIO_B1_00_GPIO6_IO00                                       IMXRT_PADCFG(0, 118, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_00_TPM5_CH00                                        IMXRT_PADCFG(0, 118, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_00_NETC_PINMUX_ETH4_TXD00                           IMXRT_PADCFG(0, 118, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_01_NETC_PINMUX_ETH1_TXD01                           IMXRT_PADCFG(0, 119, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_ADC2_CONV_D01                                    IMXRT_PADCFG(0, 119, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_SEMC_CSX02                                       IMXRT_PADCFG(0, 119, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_QTIMER1_TIMER1                                   IMXRT_PADCFG(0, 119, 0x3, 0, 239, 0x2)
#define IOMUXC_PAD_GPIO_B1_01_XBAR1_XBAR_INOUT27                               IMXRT_PADCFG(0, 119, 0x4, 0, 305, 0x1)
#define IOMUXC_PAD_GPIO_B1_01_GPIO6_IO01                                       IMXRT_PADCFG(0, 119, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_TPM5_CH01                                        IMXRT_PADCFG(0, 119, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_NETC_PINMUX_ETH4_TXD01                           IMXRT_PADCFG(0, 119, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_01_SAI4_RX_DATA00                                   IMXRT_PADCFG(0, 119, 0xc, 0, 262, 0x1)

#define IOMUXC_PAD_GPIO_B1_02_NETC_PINMUX_ETH1_TX_EN                           IMXRT_PADCFG(0, 120, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_ADC2_CONV_D02                                    IMXRT_PADCFG(0, 120, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_LPI2C6_SCL                                       IMXRT_PADCFG(0, 120, 0x2, 0,  88, 0x0)
#define IOMUXC_PAD_GPIO_B1_02_QTIMER1_TIMER2                                   IMXRT_PADCFG(0, 120, 0x3, 0, 240, 0x1)
#define IOMUXC_PAD_GPIO_B1_02_XBAR1_XBAR_INOUT28                               IMXRT_PADCFG(0, 120, 0x4, 0, 306, 0x1)
#define IOMUXC_PAD_GPIO_B1_02_GPIO6_IO02                                       IMXRT_PADCFG(0, 120, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_TPM5_CH02                                        IMXRT_PADCFG(0, 120, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_FLEXSPI1_BUS2BIT_B_SS1_B                         IMXRT_PADCFG(0, 120, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_NETC_PINMUX_ETH4_TX_EN                           IMXRT_PADCFG(0, 120, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_02_LPUART11_TX                                      IMXRT_PADCFG(0, 120, 0x9, 0, 118, 0x1)
#define IOMUXC_PAD_GPIO_B1_02_SAI4_RX_DATA01                                   IMXRT_PADCFG(0, 120, 0xc, 0, 263, 0x0)

#define IOMUXC_PAD_GPIO_B1_03_NETC_PINMUX_ETH1_TX_CLK                          IMXRT_PADCFG(0, 121, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_03_ADC2_CONV_D03                                    IMXRT_PADCFG(0, 121, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_03_LPI2C6_SDA                                       IMXRT_PADCFG(0, 121, 0x2, 0,  89, 0x0)
#define IOMUXC_PAD_GPIO_B1_03_QTIMER2_TIMER0                                   IMXRT_PADCFG(0, 121, 0x3, 0, 241, 0x2)
#define IOMUXC_PAD_GPIO_B1_03_XBAR1_XBAR_INOUT29                               IMXRT_PADCFG(0, 121, 0x4, 0, 307, 0x1)
#define IOMUXC_PAD_GPIO_B1_03_GPIO6_IO03                                       IMXRT_PADCFG(0, 121, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_03_TPM5_CH03                                        IMXRT_PADCFG(0, 121, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS                           IMXRT_PADCFG(0, 121, 0x7, 0,  42, 0x2)
#define IOMUXC_PAD_GPIO_B1_03_NETC_PINMUX_ETH4_TX_CLK                          IMXRT_PADCFG(0, 121, 0x8, 0, 237, 0x2)
#define IOMUXC_PAD_GPIO_B1_03_LPUART11_RX                                      IMXRT_PADCFG(0, 121, 0x9, 0, 117, 0x1)
#define IOMUXC_PAD_GPIO_B1_03_SAI4_RX_DATA02                                   IMXRT_PADCFG(0, 121, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_04_NETC_PINMUX_ETH1_RXD00                           IMXRT_PADCFG(0, 122, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_04_ADC2_CONV_D04                                    IMXRT_PADCFG(0, 122, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_04_LPUART9_RX                                       IMXRT_PADCFG(0, 122, 0x2, 0, 138, 0x1)
#define IOMUXC_PAD_GPIO_B1_04_QTIMER2_TIMER1                                   IMXRT_PADCFG(0, 122, 0x3, 0, 242, 0x2)
#define IOMUXC_PAD_GPIO_B1_04_XBAR1_XBAR_INOUT30                               IMXRT_PADCFG(0, 122, 0x4, 0, 308, 0x1)
#define IOMUXC_PAD_GPIO_B1_04_GPIO6_IO04                                       IMXRT_PADCFG(0, 122, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_04_TPM5_EXTCLK                                      IMXRT_PADCFG(0, 122, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B                         IMXRT_PADCFG(0, 122, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_04_NETC_PINMUX_ETH4_RXD00                           IMXRT_PADCFG(0, 122, 0x8, 0, 233, 0x2)
#define IOMUXC_PAD_GPIO_B1_04_SAI4_RX_DATA03                                   IMXRT_PADCFG(0, 122, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_05_NETC_PINMUX_ETH1_RXD01                           IMXRT_PADCFG(0, 123, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_05_ADC2_CONV_D05                                    IMXRT_PADCFG(0, 123, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_05_LPUART9_CTS_B                                    IMXRT_PADCFG(0, 123, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_05_QTIMER2_TIMER2                                   IMXRT_PADCFG(0, 123, 0x3, 0, 243, 0x1)
#define IOMUXC_PAD_GPIO_B1_05_XBAR1_XBAR_INOUT31                               IMXRT_PADCFG(0, 123, 0x4, 0, 309, 0x1)
#define IOMUXC_PAD_GPIO_B1_05_GPIO6_IO05                                       IMXRT_PADCFG(0, 123, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_05_TPM6_EXTCLK                                      IMXRT_PADCFG(0, 123, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK                          IMXRT_PADCFG(0, 123, 0x7, 0,  51, 0x1)
#define IOMUXC_PAD_GPIO_B1_05_NETC_PINMUX_ETH4_RXD01                           IMXRT_PADCFG(0, 123, 0x8, 0, 234, 0x2)
#define IOMUXC_PAD_GPIO_B1_05_SAI4_MCLK                                        IMXRT_PADCFG(0, 123, 0xc, 0, 260, 0x1)

#define IOMUXC_PAD_GPIO_B1_06_NETC_PINMUX_ETH1_RX_DV                           IMXRT_PADCFG(0, 124, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_06_ADC2_CONV_D06                                    IMXRT_PADCFG(0, 124, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_06_LPUART9_TX                                       IMXRT_PADCFG(0, 124, 0x2, 0, 139, 0x1)
#define IOMUXC_PAD_GPIO_B1_06_QTIMER3_TIMER0                                   IMXRT_PADCFG(0, 124, 0x3, 0, 244, 0x2)
#define IOMUXC_PAD_GPIO_B1_06_XBAR1_XBAR_INOUT32                               IMXRT_PADCFG(0, 124, 0x4, 0, 310, 0x1)
#define IOMUXC_PAD_GPIO_B1_06_GPIO6_IO06                                       IMXRT_PADCFG(0, 124, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_06_TPM6_CH00                                        IMXRT_PADCFG(0, 124, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07                        IMXRT_PADCFG(0, 124, 0x7, 0,  50, 0x1)
#define IOMUXC_PAD_GPIO_B1_06_NETC_PINMUX_ETH4_RX_DV                           IMXRT_PADCFG(0, 124, 0x8, 0, 231, 0x2)
#define IOMUXC_PAD_GPIO_B1_06_SAI4_RX_BCLK                                     IMXRT_PADCFG(0, 124, 0xc, 0, 261, 0x1)

#define IOMUXC_PAD_GPIO_B1_07_NETC_PINMUX_ETH1_TXD02                           IMXRT_PADCFG(0, 125, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_07_ADC2_CONV_D07                                    IMXRT_PADCFG(0, 125, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_07_LPUART9_RTS_B                                    IMXRT_PADCFG(0, 125, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_07_QTIMER3_TIMER1                                   IMXRT_PADCFG(0, 125, 0x3, 0, 245, 0x2)
#define IOMUXC_PAD_GPIO_B1_07_XBAR1_XBAR_INOUT33                               IMXRT_PADCFG(0, 125, 0x4, 0, 311, 0x1)
#define IOMUXC_PAD_GPIO_B1_07_GPIO6_IO07                                       IMXRT_PADCFG(0, 125, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_07_TPM6_CH01                                        IMXRT_PADCFG(0, 125, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06                        IMXRT_PADCFG(0, 125, 0x7, 0,  49, 0x1)
#define IOMUXC_PAD_GPIO_B1_07_NETC_PINMUX_ETH4_TXD02                           IMXRT_PADCFG(0, 125, 0x8, 0, 232, 0x2)
#define IOMUXC_PAD_GPIO_B1_07_LPSPI6_SDI                                       IMXRT_PADCFG(0, 125, 0x9, 0, 113, 0x2)
#define IOMUXC_PAD_GPIO_B1_07_SAI4_RX_SYNC                                     IMXRT_PADCFG(0, 125, 0xc, 0, 264, 0x1)

#define IOMUXC_PAD_GPIO_B1_08_NETC_PINMUX_ETH1_TXD03                           IMXRT_PADCFG(0, 126, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_08_ADC2_CONV_RDY_CLK                                IMXRT_PADCFG(0, 126, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_08_USDHC1_CD_B                                      IMXRT_PADCFG(0, 126, 0x2, 0, 289, 0x1)
#define IOMUXC_PAD_GPIO_B1_08_QTIMER3_TIMER2                                   IMXRT_PADCFG(0, 126, 0x3, 0, 246, 0x1)
#define IOMUXC_PAD_GPIO_B1_08_XBAR1_XBAR_INOUT36                               IMXRT_PADCFG(0, 126, 0x4, 0, 314, 0x1)
#define IOMUXC_PAD_GPIO_B1_08_GPIO6_IO08                                       IMXRT_PADCFG(0, 126, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_08_TPM6_CH02                                        IMXRT_PADCFG(0, 126, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05                        IMXRT_PADCFG(0, 126, 0x7, 0,  48, 0x1)
#define IOMUXC_PAD_GPIO_B1_08_NETC_PINMUX_ETH4_TXD03                           IMXRT_PADCFG(0, 126, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_08_LPSPI6_SDO                                       IMXRT_PADCFG(0, 126, 0x9, 0, 114, 0x2)
#define IOMUXC_PAD_GPIO_B1_08_SAI4_TX_BCLK                                     IMXRT_PADCFG(0, 126, 0xc, 0, 265, 0x1)

#define IOMUXC_PAD_GPIO_B1_09_NETC_PINMUX_ETH1_RXD02                           IMXRT_PADCFG(0, 127, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_09_USDHC1_WP                                        IMXRT_PADCFG(0, 127, 0x2, 0, 290, 0x1)
#define IOMUXC_PAD_GPIO_B1_09_QTIMER4_TIMER0                                   IMXRT_PADCFG(0, 127, 0x3, 0, 247, 0x2)
#define IOMUXC_PAD_GPIO_B1_09_XBAR1_XBAR_INOUT37                               IMXRT_PADCFG(0, 127, 0x4, 0, 315, 0x1)
#define IOMUXC_PAD_GPIO_B1_09_GPIO6_IO09                                       IMXRT_PADCFG(0, 127, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_09_TPM6_CH03                                        IMXRT_PADCFG(0, 127, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04                        IMXRT_PADCFG(0, 127, 0x7, 0,  47, 0x1)
#define IOMUXC_PAD_GPIO_B1_09_NETC_PINMUX_ETH4_RXD02                           IMXRT_PADCFG(0, 127, 0x8, 0, 235, 0x2)
#define IOMUXC_PAD_GPIO_B1_09_LPSPI6_PCS1                                      IMXRT_PADCFG(0, 127, 0x9, 0, 109, 0x2)
#define IOMUXC_PAD_GPIO_B1_09_SAI4_TX_SYNC                                     IMXRT_PADCFG(0, 127, 0xc, 0, 266, 0x1)

#define IOMUXC_PAD_GPIO_B1_10_NETC_PINMUX_ETH1_RXD03                           IMXRT_PADCFG(0, 128, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_10_USDHC1_RESET_B                                   IMXRT_PADCFG(0, 128, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_10_QTIMER4_TIMER1                                   IMXRT_PADCFG(0, 128, 0x3, 0, 248, 0x2)
#define IOMUXC_PAD_GPIO_B1_10_XBAR1_XBAR_INOUT34                               IMXRT_PADCFG(0, 128, 0x4, 0, 312, 0x1)
#define IOMUXC_PAD_GPIO_B1_10_GPIO6_IO10                                       IMXRT_PADCFG(0, 128, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03                        IMXRT_PADCFG(0, 128, 0x7, 0,  46, 0x1)
#define IOMUXC_PAD_GPIO_B1_10_NETC_PINMUX_ETH4_RXD03                           IMXRT_PADCFG(0, 128, 0x8, 0, 236, 0x2)
#define IOMUXC_PAD_GPIO_B1_10_LPSPI6_PCS2                                      IMXRT_PADCFG(0, 128, 0x9, 0, 110, 0x2)
#define IOMUXC_PAD_GPIO_B1_10_SAI4_TX_DATA00                                   IMXRT_PADCFG(0, 128, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_11_NETC_PINMUX_ETH1_RX_CLK                          IMXRT_PADCFG(0, 129, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_11_QTIMER4_TIMER2                                   IMXRT_PADCFG(0, 129, 0x3, 0, 249, 0x1)
#define IOMUXC_PAD_GPIO_B1_11_XBAR1_XBAR_INOUT35                               IMXRT_PADCFG(0, 129, 0x4, 0, 313, 0x1)
#define IOMUXC_PAD_GPIO_B1_11_GPIO6_IO11                                       IMXRT_PADCFG(0, 129, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02                        IMXRT_PADCFG(0, 129, 0x7, 0,  45, 0x1)
#define IOMUXC_PAD_GPIO_B1_11_NETC_PINMUX_ETH4_RX_CLK                          IMXRT_PADCFG(0, 129, 0x8, 0, 230, 0x2)
#define IOMUXC_PAD_GPIO_B1_11_LPSPI6_PCS3                                      IMXRT_PADCFG(0, 129, 0x9, 0, 111, 0x1)
#define IOMUXC_PAD_GPIO_B1_11_SAI4_TX_DATA01                                   IMXRT_PADCFG(0, 129, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B1_12_NETC_PINMUX_ETH1_RX_ER                           IMXRT_PADCFG(0, 130, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_12_NETC_EMDIO                                       IMXRT_PADCFG(0, 130, 0x1, 0, 190, 0x6)
#define IOMUXC_PAD_GPIO_B1_12_GPIO6_IO12                                       IMXRT_PADCFG(0, 130, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01                        IMXRT_PADCFG(0, 130, 0x7, 0,  44, 0x1)
#define IOMUXC_PAD_GPIO_B1_12_NETC_PINMUX_ETH4_RX_ER                           IMXRT_PADCFG(0, 130, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_12_LPSPI6_PCS0                                      IMXRT_PADCFG(0, 130, 0x9, 0, 108, 0x2)
#define IOMUXC_PAD_GPIO_B1_12_SAI4_TX_DATA02                                   IMXRT_PADCFG(0, 130, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

