apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_B1_13_NETC_PINMUX_ETH1_TX_ER                           IMXRT_PADCFG(0, 131, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_NETC_EMDC                                        IMXRT_PADCFG(0, 131, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_USDHC1_VSELECT                                   IMXRT_PADCFG(0, 131, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_CCM_ENET_REF_CLK_25M                             IMXRT_PADCFG(0, 131, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_GPIO6_IO13                                       IMXRT_PADCFG(0, 131, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00                        IMXRT_PADCFG(0, 131, 0x7, 0,  43, 0x1)
#define IOMUXC_PAD_GPIO_B1_13_NETC_PINMUX_ETH4_TX_ER                           IMXRT_PADCFG(0, 131, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B1_13_LPSPI6_SCK                                       IMXRT_PADCFG(0, 131, 0x9, 0, 112, 0x2)
#define IOMUXC_PAD_GPIO_B1_13_SAI4_TX_DATA03                                   IMXRT_PADCFG(0, 131, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_00_NETC_ETH1_CRS                                    IMXRT_PADCFG(0, 132, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_00_SEMC_CSX03                                       IMXRT_PADCFG(0, 132, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_00_LPIT3_TRIGGER00                                  IMXRT_PADCFG(0, 132, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_00_SAI4_MCLK                                        IMXRT_PADCFG(0, 132, 0x4, 0, 260, 0x2)
#define IOMUXC_PAD_GPIO_B2_00_GPIO6_IO14                                       IMXRT_PADCFG(0, 132, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_00_NETC_ETH4_CRS                                    IMXRT_PADCFG(0, 132, 0x8, 0, 200, 0x2)
#define IOMUXC_PAD_GPIO_B2_00_LPSPI6_SDI                                       IMXRT_PADCFG(0, 132, 0x9, 0, 113, 0x3)
#define IOMUXC_PAD_GPIO_B2_00_NETC_ETH2_SLV_MDIO                               IMXRT_PADCFG(0, 132, 0xa, 0, 194, 0x2)
#define IOMUXC_PAD_GPIO_B2_00_ECAT_CLK_ECAT_CLK25                              IMXRT_PADCFG(0, 132, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_01_NETC_ETH1_COL                                    IMXRT_PADCFG(0, 133, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_01_LPIT3_TRIGGER01                                  IMXRT_PADCFG(0, 133, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_01_SAI4_TX_BCLK                                     IMXRT_PADCFG(0, 133, 0x4, 0, 265, 0x2)
#define IOMUXC_PAD_GPIO_B2_01_GPIO6_IO15                                       IMXRT_PADCFG(0, 133, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_01_FLEXSPI1_BUS2BIT_A_SS1_B                         IMXRT_PADCFG(0, 133, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_01_NETC_ETH4_COL                                    IMXRT_PADCFG(0, 133, 0x8, 0, 199, 0x2)
#define IOMUXC_PAD_GPIO_B2_01_LPSPI6_SDO                                       IMXRT_PADCFG(0, 133, 0x9, 0, 114, 0x3)
#define IOMUXC_PAD_GPIO_B2_01_NETC_ETH2_SLV_MDC                                IMXRT_PADCFG(0, 133, 0xa, 0, 193, 0x2)
#define IOMUXC_PAD_GPIO_B2_01_NETC_PINMUX_ETH2_RX_ER                           IMXRT_PADCFG(0, 133, 0xb, 0, 216, 0x1)
#define IOMUXC_PAD_GPIO_B2_01_ECAT_RX_ER_1                                     IMXRT_PADCFG(0, 133, 0xc, 0,  16, 0x2)

#define IOMUXC_PAD_GPIO_B2_02_LPIT3_TRIGGER02                                  IMXRT_PADCFG(0, 134, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_02_NETC_EMDIO                                       IMXRT_PADCFG(0, 134, 0x3, 0, 190, 0x7)
#define IOMUXC_PAD_GPIO_B2_02_SAI4_TX_SYNC                                     IMXRT_PADCFG(0, 134, 0x4, 0, 266, 0x2)
#define IOMUXC_PAD_GPIO_B2_02_GPIO6_IO16                                       IMXRT_PADCFG(0, 134, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_02_FLEXSPI1_BUS2BIT_B_SCLK                          IMXRT_PADCFG(0, 134, 0x6, 0,  51, 0x2)
#define IOMUXC_PAD_GPIO_B2_02_CCM_ENET_REF_CLK_25M                             IMXRT_PADCFG(0, 134, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_02_EWM_EWM_OUT_B                                    IMXRT_PADCFG(0, 134, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_02_NETC_PINMUX_ETH2_RXD02                           IMXRT_PADCFG(0, 134, 0xb, 0, 219, 0x2)
#define IOMUXC_PAD_GPIO_B2_02_ECAT_RX_DATA2_1                                  IMXRT_PADCFG(0, 134, 0xc, 0,  10, 0x1)

#define IOMUXC_PAD_GPIO_B2_03_LPIT3_TRIGGER03                                  IMXRT_PADCFG(0, 135, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_03_NETC_EMDC                                        IMXRT_PADCFG(0, 135, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_03_SAI4_TX_DATA00                                   IMXRT_PADCFG(0, 135, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_03_GPIO6_IO17                                       IMXRT_PADCFG(0, 135, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_03_FLEXSPI1_BUS2BIT_A_DATA04                        IMXRT_PADCFG(0, 135, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_03_XSPI_SLV_DATA04                                  IMXRT_PADCFG(0, 135, 0xa, 0, 350, 0x2)
#define IOMUXC_PAD_GPIO_B2_03_NETC_PINMUX_ETH2_RXD03                           IMXRT_PADCFG(0, 135, 0xb, 0, 220, 0x2)
#define IOMUXC_PAD_GPIO_B2_03_ECAT_RX_DATA3_1                                  IMXRT_PADCFG(0, 135, 0xc, 0,  12, 0x1)

#define IOMUXC_PAD_GPIO_B2_04_SINC1_MOD_CLK0                                   IMXRT_PADCFG(0, 136, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_SINC2_MOD_CLK0                                   IMXRT_PADCFG(0, 136, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_SINC3_MOD_CLK0                                   IMXRT_PADCFG(0, 136, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_SAI4_RX_SYNC                                     IMXRT_PADCFG(0, 136, 0x4, 0, 264, 0x2)
#define IOMUXC_PAD_GPIO_B2_04_GPIO6_IO18                                       IMXRT_PADCFG(0, 136, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_FLEXSPI1_BUS2BIT_A_DATA05                        IMXRT_PADCFG(0, 136, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_TPM3_EXTCLK                                      IMXRT_PADCFG(0, 136, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_XSPI_SLV_DATA05                                  IMXRT_PADCFG(0, 136, 0xa, 0, 351, 0x2)
#define IOMUXC_PAD_GPIO_B2_04_NETC_PINMUX_ETH2_TXD02                           IMXRT_PADCFG(0, 136, 0xb, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_04_ECAT_TX_DATA2_1                                  IMXRT_PADCFG(0, 136, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_05_SINC1_MOD_CLK1                                   IMXRT_PADCFG(0, 137, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_SINC2_MOD_CLK1                                   IMXRT_PADCFG(0, 137, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_SINC3_MOD_CLK1                                   IMXRT_PADCFG(0, 137, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_SAI4_RX_BCLK                                     IMXRT_PADCFG(0, 137, 0x4, 0, 261, 0x2)
#define IOMUXC_PAD_GPIO_B2_05_GPIO6_IO19                                       IMXRT_PADCFG(0, 137, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_MIC_CLK                                          IMXRT_PADCFG(0, 137, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_FLEXSPI1_BUS2BIT_A_DATA06                        IMXRT_PADCFG(0, 137, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_TPM3_CH00                                        IMXRT_PADCFG(0, 137, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_XSPI_SLV_DATA06                                  IMXRT_PADCFG(0, 137, 0xa, 0, 352, 0x2)
#define IOMUXC_PAD_GPIO_B2_05_NETC_PINMUX_ETH2_TXD03                           IMXRT_PADCFG(0, 137, 0xb, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_05_ECAT_TX_DATA3_1                                  IMXRT_PADCFG(0, 137, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

