apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_B2_06_SINC1_MOD_CLK2                                   IMXRT_PADCFG(0, 138, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_SINC2_MOD_CLK2                                   IMXRT_PADCFG(0, 138, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_SINC3_MOD_CLK2                                   IMXRT_PADCFG(0, 138, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_LPUART6_DSR_B                                    IMXRT_PADCFG(0, 138, 0x3, 0, 131, 0x1)
#define IOMUXC_PAD_GPIO_B2_06_SAI4_RX_DATA00                                   IMXRT_PADCFG(0, 138, 0x4, 0, 262, 0x2)
#define IOMUXC_PAD_GPIO_B2_06_GPIO6_IO20                                       IMXRT_PADCFG(0, 138, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_FLEXSPI1_BUS2BIT_A_DATA07                        IMXRT_PADCFG(0, 138, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_TPM3_CH01                                        IMXRT_PADCFG(0, 138, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_LPUART11_TX                                      IMXRT_PADCFG(0, 138, 0x9, 0, 118, 0x2)
#define IOMUXC_PAD_GPIO_B2_06_XSPI_SLV_DATA07                                  IMXRT_PADCFG(0, 138, 0xa, 0, 353, 0x2)
#define IOMUXC_PAD_GPIO_B2_06_NETC_PINMUX_ETH2_TXD00                           IMXRT_PADCFG(0, 138, 0xb, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_06_ECAT_TX_DATA0_1                                  IMXRT_PADCFG(0, 138, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_07_QTIMER5_TIMER0                                   IMXRT_PADCFG(0, 139, 0x0, 0, 250, 0x2)
#define IOMUXC_PAD_GPIO_B2_07_LPUART6_DCD_B                                    IMXRT_PADCFG(0, 139, 0x3, 0, 130, 0x1)
#define IOMUXC_PAD_GPIO_B2_07_SAI4_TX_DATA01                                   IMXRT_PADCFG(0, 139, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_07_GPIO6_IO21                                       IMXRT_PADCFG(0, 139, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_07_SAI4_RX_DATA01                                   IMXRT_PADCFG(0, 139, 0x6, 0, 263, 0x1)
#define IOMUXC_PAD_GPIO_B2_07_FLEXSPI1_BUS2BIT_A_DQS                           IMXRT_PADCFG(0, 139, 0x7, 0,  41, 0x1)
#define IOMUXC_PAD_GPIO_B2_07_TPM3_CH02                                        IMXRT_PADCFG(0, 139, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_07_LPUART11_RX                                      IMXRT_PADCFG(0, 139, 0x9, 0, 117, 0x2)
#define IOMUXC_PAD_GPIO_B2_07_XSPI_SLV_DQS                                     IMXRT_PADCFG(0, 139, 0xa, 0, 345, 0x1)
#define IOMUXC_PAD_GPIO_B2_07_NETC_PINMUX_ETH2_TXD01                           IMXRT_PADCFG(0, 139, 0xb, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_07_ECAT_TX_DATA1_1                                  IMXRT_PADCFG(0, 139, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_08_QTIMER5_TIMER1                                   IMXRT_PADCFG(0, 140, 0x0, 0, 251, 0x2)
#define IOMUXC_PAD_GPIO_B2_08_SINC2_EMCLK02                                    IMXRT_PADCFG(0, 140, 0x1, 0, 280, 0x2)
#define IOMUXC_PAD_GPIO_B2_08_LPUART6_RI_B                                     IMXRT_PADCFG(0, 140, 0x4, 0, 132, 0x1)
#define IOMUXC_PAD_GPIO_B2_08_GPIO6_IO22                                       IMXRT_PADCFG(0, 140, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_08_LPI2C6_SCL                                       IMXRT_PADCFG(0, 140, 0x6, 0,  88, 0x1)
#define IOMUXC_PAD_GPIO_B2_08_FLEXSPI1_BUS2BIT_A_SCLK                          IMXRT_PADCFG(0, 140, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_08_TPM3_CH03                                        IMXRT_PADCFG(0, 140, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_08_SPDIF_IN                                         IMXRT_PADCFG(0, 140, 0x9, 0, 282, 0x2)
#define IOMUXC_PAD_GPIO_B2_08_XSPI_SLV_CLK                                     IMXRT_PADCFG(0, 140, 0xa, 0, 354, 0x2)
#define IOMUXC_PAD_GPIO_B2_08_NETC_PINMUX_ETH2_TX_EN                           IMXRT_PADCFG(0, 140, 0xb, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_08_ECAT_TX_EN_1                                     IMXRT_PADCFG(0, 140, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_B2_09_QTIMER5_TIMER2                                   IMXRT_PADCFG(0, 141, 0x0, 0, 252, 0x1)
#define IOMUXC_PAD_GPIO_B2_09_SINC2_EMBIT02                                    IMXRT_PADCFG(0, 141, 0x1, 0, 277, 0x2)
#define IOMUXC_PAD_GPIO_B2_09_LPUART6_DTR_B                                    IMXRT_PADCFG(0, 141, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_09_GPIO6_IO23                                       IMXRT_PADCFG(0, 141, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_09_LPI2C6_SDA                                       IMXRT_PADCFG(0, 141, 0x6, 0,  89, 0x1)
#define IOMUXC_PAD_GPIO_B2_09_FLEXSPI1_BUS2BIT_A_SS0_B                         IMXRT_PADCFG(0, 141, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_09_TPM4_EXTCLK                                      IMXRT_PADCFG(0, 141, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_09_SPDIF_OUT                                        IMXRT_PADCFG(0, 141, 0x9, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_09_XSPI_SLV_CS                                      IMXRT_PADCFG(0, 141, 0xa, 0, 344, 0x2)
#define IOMUXC_PAD_GPIO_B2_09_NETC_PINMUX_ETH2_TX_CLK                          IMXRT_PADCFG(0, 141, 0xb, 0, 221, 0x2)
#define IOMUXC_PAD_GPIO_B2_09_ECAT_TX_CLK_1                                    IMXRT_PADCFG(0, 141, 0xc, 0,  18, 0x2)

#define IOMUXC_PAD_GPIO_B2_10_MIC_BITSTREAM00                                  IMXRT_PADCFG(0, 142, 0x0, 0, 140, 0x3)
#define IOMUXC_PAD_GPIO_B2_10_SINC2_EMCLK03                                    IMXRT_PADCFG(0, 142, 0x1, 0, 281, 0x1)
#define IOMUXC_PAD_GPIO_B2_10_CAN3_TX                                          IMXRT_PADCFG(0, 142, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_10_LPUART8_CTS_B                                    IMXRT_PADCFG(0, 142, 0x3, 0, 135, 0x1)
#define IOMUXC_PAD_GPIO_B2_10_LPUART6_TX                                       IMXRT_PADCFG(0, 142, 0x4, 0, 134, 0x2)
#define IOMUXC_PAD_GPIO_B2_10_GPIO6_IO24                                       IMXRT_PADCFG(0, 142, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_10_LPI2C4_SCL                                       IMXRT_PADCFG(0, 142, 0x6, 0,  84, 0x1)
#define IOMUXC_PAD_GPIO_B2_10_FLEXSPI1_BUS2BIT_A_DATA00                        IMXRT_PADCFG(0, 142, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_10_TPM4_CH00                                        IMXRT_PADCFG(0, 142, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_10_LPSPI4_SCK                                       IMXRT_PADCFG(0, 142, 0x9, 0,  98, 0x2)
#define IOMUXC_PAD_GPIO_B2_10_XSPI_SLV_DATA00                                  IMXRT_PADCFG(0, 142, 0xa, 0, 346, 0x1)
#define IOMUXC_PAD_GPIO_B2_10_NETC_PINMUX_ETH2_RXD00                           IMXRT_PADCFG(0, 142, 0xb, 0, 217, 0x2)
#define IOMUXC_PAD_GPIO_B2_10_ECAT_RX_DATA0_1                                  IMXRT_PADCFG(0, 142, 0xc, 0,   6, 0x2)

#define IOMUXC_PAD_GPIO_B2_11_MIC_BITSTREAM01                                  IMXRT_PADCFG(0, 143, 0x0, 0, 141, 0x3)
#define IOMUXC_PAD_GPIO_B2_11_SINC2_EMBIT03                                    IMXRT_PADCFG(0, 143, 0x1, 0, 278, 0x1)
#define IOMUXC_PAD_GPIO_B2_11_CAN3_RX                                          IMXRT_PADCFG(0, 143, 0x2, 0,   2, 0x1)
#define IOMUXC_PAD_GPIO_B2_11_LPUART8_RTS_B                                    IMXRT_PADCFG(0, 143, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_11_LPUART6_RX                                       IMXRT_PADCFG(0, 143, 0x4, 0, 133, 0x2)
#define IOMUXC_PAD_GPIO_B2_11_GPIO6_IO25                                       IMXRT_PADCFG(0, 143, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_11_LPI2C4_SDA                                       IMXRT_PADCFG(0, 143, 0x6, 0,  85, 0x1)
#define IOMUXC_PAD_GPIO_B2_11_FLEXSPI1_BUS2BIT_A_DATA01                        IMXRT_PADCFG(0, 143, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_11_TPM4_CH01                                        IMXRT_PADCFG(0, 143, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_11_LPSPI4_SDI                                       IMXRT_PADCFG(0, 143, 0x9, 0,  99, 0x2)
#define IOMUXC_PAD_GPIO_B2_11_XSPI_SLV_DATA01                                  IMXRT_PADCFG(0, 143, 0xa, 0, 347, 0x1)
#define IOMUXC_PAD_GPIO_B2_11_NETC_PINMUX_ETH2_RXD01                           IMXRT_PADCFG(0, 143, 0xb, 0, 218, 0x2)
#define IOMUXC_PAD_GPIO_B2_11_ECAT_RX_DATA1_1                                  IMXRT_PADCFG(0, 143, 0xc, 0,   8, 0x2)

#define IOMUXC_PAD_GPIO_B2_12_MIC_BITSTREAM02                                  IMXRT_PADCFG(0, 144, 0x0, 0, 142, 0x3)
#define IOMUXC_PAD_GPIO_B2_12_SINC_FILTER_GLUE2_BREAK                          IMXRT_PADCFG(0, 144, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_12_LPUART8_TX                                       IMXRT_PADCFG(0, 144, 0x2, 0, 137, 0x2)
#define IOMUXC_PAD_GPIO_B2_12_LPUART6_CTS_B                                    IMXRT_PADCFG(0, 144, 0x4, 0, 129, 0x2)
#define IOMUXC_PAD_GPIO_B2_12_GPIO6_IO26                                       IMXRT_PADCFG(0, 144, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_12_CAN3_TX                                          IMXRT_PADCFG(0, 144, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_12_FLEXSPI1_BUS2BIT_A_DATA02                        IMXRT_PADCFG(0, 144, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_12_TPM4_CH02                                        IMXRT_PADCFG(0, 144, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_12_LPSPI4_SDO                                       IMXRT_PADCFG(0, 144, 0x9, 0, 100, 0x2)
#define IOMUXC_PAD_GPIO_B2_12_XSPI_SLV_DATA02                                  IMXRT_PADCFG(0, 144, 0xa, 0, 348, 0x1)
#define IOMUXC_PAD_GPIO_B2_12_NETC_PINMUX_ETH2_RX_DV                           IMXRT_PADCFG(0, 144, 0xb, 0, 215, 0x2)
#define IOMUXC_PAD_GPIO_B2_12_ECAT_RX_DV_1                                     IMXRT_PADCFG(0, 144, 0xc, 0,  14, 0x2)

#define IOMUXC_PAD_GPIO_B2_13_MIC_BITSTREAM03                                  IMXRT_PADCFG(0, 145, 0x0, 0, 143, 0x3)
#define IOMUXC_PAD_GPIO_B2_13_SINC2_EMCLK00                                    IMXRT_PADCFG(0, 145, 0x1, 0, 279, 0x1)
#define IOMUXC_PAD_GPIO_B2_13_LPUART8_RX                                       IMXRT_PADCFG(0, 145, 0x2, 0, 136, 0x2)
#define IOMUXC_PAD_GPIO_B2_13_LPUART6_RTS_B                                    IMXRT_PADCFG(0, 145, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_13_GPIO6_IO27                                       IMXRT_PADCFG(0, 145, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_13_CAN3_RX                                          IMXRT_PADCFG(0, 145, 0x6, 0,   2, 0x2)
#define IOMUXC_PAD_GPIO_B2_13_FLEXSPI1_BUS2BIT_A_DATA03                        IMXRT_PADCFG(0, 145, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_13_TPM4_CH03                                        IMXRT_PADCFG(0, 145, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_B2_13_LPSPI4_PCS0                                      IMXRT_PADCFG(0, 145, 0x9, 0,  97, 0x2)
#define IOMUXC_PAD_GPIO_B2_13_XSPI_SLV_DATA03                                  IMXRT_PADCFG(0, 145, 0xa, 0, 349, 0x1)
#define IOMUXC_PAD_GPIO_B2_13_NETC_PINMUX_ETH2_RX_CLK                          IMXRT_PADCFG(0, 145, 0xb, 0, 214, 0x3)
#define IOMUXC_PAD_GPIO_B2_13_ECAT_RX_CLK_1                                    IMXRT_PADCFG(0, 145, 0xc, 0,   4, 0x1)

#define IOMUXC_PAD_GPIO_AON_00_SRC_BOOT_MODE00                                 IMXRT_PADCFG(1,   0, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_00_CAN1_TX                                         IMXRT_PADCFG(1,   0, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_00_LPTMR1_ALT1                                     IMXRT_PADCFG(1,   0, 0x4, 1,  17, 0x0)
#define IOMUXC_PAD_GPIO_AON_00_GPIO1_IO00                                      IMXRT_PADCFG(1,   0, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_00_LPUART2_TX                                      IMXRT_PADCFG(1,   0, 0x6, 1,  28, 0x0)
#define IOMUXC_PAD_GPIO_AON_00_TPM1_EXTCLK                                     IMXRT_PADCFG(1,   0, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_01_SRC_BOOT_MODE01                                 IMXRT_PADCFG(1,   1, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_01_CAN1_RX                                         IMXRT_PADCFG(1,   1, 0x1, 0,   0, 0x1)
#define IOMUXC_PAD_GPIO_AON_01_LPTMR1_ALT2                                     IMXRT_PADCFG(1,   1, 0x4, 1,  18, 0x0)
#define IOMUXC_PAD_GPIO_AON_01_GPIO1_IO01                                      IMXRT_PADCFG(1,   1, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_01_LPUART2_RX                                      IMXRT_PADCFG(1,   1, 0x6, 1,  27, 0x0)
#define IOMUXC_PAD_GPIO_AON_01_TPM1_CH00                                       IMXRT_PADCFG(1,   1, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_02_SRC_BOOT_MODE02                                 IMXRT_PADCFG(1,   2, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_02_CAN3_TX                                         IMXRT_PADCFG(1,   2, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_02_LPSPI2_PCS3                                     IMXRT_PADCFG(1,   2, 0x2, 1,  13, 0x0)
#define IOMUXC_PAD_GPIO_AON_02_LPSPI2_SDO                                      IMXRT_PADCFG(1,   2, 0x3, 1,  16, 0x0)
#define IOMUXC_PAD_GPIO_AON_02_LPTMR1_ALT3                                     IMXRT_PADCFG(1,   2, 0x4, 1,  19, 0x0)
#define IOMUXC_PAD_GPIO_AON_02_GPIO1_IO02                                      IMXRT_PADCFG(1,   2, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_02_LPUART2_RTS_B                                   IMXRT_PADCFG(1,   2, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_02_TPM1_CH01                                       IMXRT_PADCFG(1,   2, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_02_ECAT_CLK_ECAT_CLK25                             IMXRT_PADCFG(1,   2, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

