apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AON_03_CAN3_RX                                         IMXRT_PADCFG(1,   3, 0x1, 0,   2, 0x3)
#define IOMUXC_PAD_GPIO_AON_03_LPSPI1_PCS1                                     IMXRT_PADCFG(1,   3, 0x2, 1,   7, 0x0)
#define IOMUXC_PAD_GPIO_AON_03_LPSPI2_SDI                                      IMXRT_PADCFG(1,   3, 0x3, 1,  15, 0x0)
#define IOMUXC_PAD_GPIO_AON_03_LPSPI1_PCS3                                     IMXRT_PADCFG(1,   3, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_03_GPIO1_IO03                                      IMXRT_PADCFG(1,   3, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_03_LPUART2_CTS_B                                   IMXRT_PADCFG(1,   3, 0x6, 1,  26, 0x0)
#define IOMUXC_PAD_GPIO_AON_03_TPM1_CH02                                       IMXRT_PADCFG(1,   3, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_03_ECAT_LED_STATE_RUN                              IMXRT_PADCFG(1,   3, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_04_LPSPI1_SCK                                      IMXRT_PADCFG(1,   4, 0x0, 1,   8, 0x0)
#define IOMUXC_PAD_GPIO_AON_04_SAI1_TX_DATA00                                  IMXRT_PADCFG(1,   4, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_04_SAI1_RX_DATA01                                  IMXRT_PADCFG(1,   4, 0x3, 1,  35, 0x0)
#define IOMUXC_PAD_GPIO_AON_04_GPIO1_IO04                                      IMXRT_PADCFG(1,   4, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_04_LPUART7_CTS_B                                   IMXRT_PADCFG(1,   4, 0x6, 1,  29, 0x0)
#define IOMUXC_PAD_GPIO_AON_04_TPM1_CH03                                       IMXRT_PADCFG(1,   4, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_04_ECAT_LED_RUN                                    IMXRT_PADCFG(1,   4, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_05_LPSPI1_PCS0                                     IMXRT_PADCFG(1,   5, 0x0, 1,   6, 0x0)
#define IOMUXC_PAD_GPIO_AON_05_SAI1_TX_SYNC                                    IMXRT_PADCFG(1,   5, 0x2, 1,  38, 0x0)
#define IOMUXC_PAD_GPIO_AON_05_GPIO1_IO05                                      IMXRT_PADCFG(1,   5, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_05_LPUART7_RTS_B                                   IMXRT_PADCFG(1,   5, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_05_NMI_GLUE_NMI                                    IMXRT_PADCFG(1,   5, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_05_ECAT_LED_ERR                                    IMXRT_PADCFG(1,   5, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_06_LPSPI1_SDO                                      IMXRT_PADCFG(1,   6, 0x0, 1,  10, 0x0)
#define IOMUXC_PAD_GPIO_AON_06_I3C1_PUR                                        IMXRT_PADCFG(1,   6, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_06_SAI1_TX_BCLK                                    IMXRT_PADCFG(1,   6, 0x2, 1,  37, 0x0)
#define IOMUXC_PAD_GPIO_AON_06_LPI2C1_SDA                                      IMXRT_PADCFG(1,   6, 0x3, 1,   3, 0x0)
#define IOMUXC_PAD_GPIO_AON_06_GPIO1_IO06                                      IMXRT_PADCFG(1,   6, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_06_CAN1_TX                                         IMXRT_PADCFG(1,   6, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_06_ECAT_SDA                                        IMXRT_PADCFG(1,   6, 0xc, 0,  20, 0x1)

#define IOMUXC_PAD_GPIO_AON_07_LPSPI1_SDI                                      IMXRT_PADCFG(1,   7, 0x0, 1,   9, 0x0)
#define IOMUXC_PAD_GPIO_AON_07_SAI1_MCLK                                       IMXRT_PADCFG(1,   7, 0x2, 1,  32, 0x0)
#define IOMUXC_PAD_GPIO_AON_07_LPI2C1_SCL                                      IMXRT_PADCFG(1,   7, 0x3, 1,   2, 0x0)
#define IOMUXC_PAD_GPIO_AON_07_GPIO1_IO07                                      IMXRT_PADCFG(1,   7, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_07_CAN1_RX                                         IMXRT_PADCFG(1,   7, 0x6, 0,   0, 0x2)
#define IOMUXC_PAD_GPIO_AON_07_ECAT_SCL                                        IMXRT_PADCFG(1,   7, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_08_LPUART1_TX                                      IMXRT_PADCFG(1,   8, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_08_S400_TX                                         IMXRT_PADCFG(1,   8, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_08_SAI1_RX_DATA00                                  IMXRT_PADCFG(1,   8, 0x2, 1,  34, 0x0)
#define IOMUXC_PAD_GPIO_AON_08_SAI1_TX_DATA01                                  IMXRT_PADCFG(1,   8, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_08_GPIO1_IO08                                      IMXRT_PADCFG(1,   8, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_08_LPI2C1_SDA                                      IMXRT_PADCFG(1,   8, 0x6, 1,   3, 0x1)
#define IOMUXC_PAD_GPIO_AON_08_LPSPI1_PCS1                                     IMXRT_PADCFG(1,   8, 0x8, 1,   7, 0x1)
#define IOMUXC_PAD_GPIO_AON_08_ECAT_LINK_ACT00                                 IMXRT_PADCFG(1,   8, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_09_LPUART1_RX                                      IMXRT_PADCFG(1,   9, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_09_S400_RX                                         IMXRT_PADCFG(1,   9, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_09_SAI1_RX_BCLK                                    IMXRT_PADCFG(1,   9, 0x2, 1,  33, 0x0)
#define IOMUXC_PAD_GPIO_AON_09_LPIT1_TRIGGER00                                 IMXRT_PADCFG(1,   9, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_09_GPIO1_IO09                                      IMXRT_PADCFG(1,   9, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_09_LPI2C1_SCL                                      IMXRT_PADCFG(1,   9, 0x6, 1,   2, 0x1)
#define IOMUXC_PAD_GPIO_AON_09_LPSPI1_PCS2                                     IMXRT_PADCFG(1,   9, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_09_ECAT_LINK_ACT01                                 IMXRT_PADCFG(1,   9, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

