apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AON_10_JTAG_MUX_TRSTB                                  IMXRT_PADCFG(1,  10, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_10_LPSPI2_PCS0                                     IMXRT_PADCFG(1,  10, 0x1, 1,  11, 0x0)
#define IOMUXC_PAD_GPIO_AON_10_SAI1_RX_SYNC                                    IMXRT_PADCFG(1,  10, 0x2, 1,  36, 0x0)
#define IOMUXC_PAD_GPIO_AON_10_LPIT1_TRIGGER01                                 IMXRT_PADCFG(1,  10, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_10_TPM2_EXTCLK                                     IMXRT_PADCFG(1,  10, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_10_GPIO1_IO10                                      IMXRT_PADCFG(1,  10, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_10_LPI2C1_SCLS                                     IMXRT_PADCFG(1,  10, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_11_JTAG_MUX_TDO                                    IMXRT_PADCFG(1,  11, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_11_LPUART1_CTS_B                                   IMXRT_PADCFG(1,  11, 0x2, 1,  20, 0x0)
#define IOMUXC_PAD_GPIO_AON_11_LPIT1_TRIGGER02                                 IMXRT_PADCFG(1,  11, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_11_TPM2_CH00                                       IMXRT_PADCFG(1,  11, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_11_GPIO1_IO11                                      IMXRT_PADCFG(1,  11, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_11_LPI2C1_SDAS                                     IMXRT_PADCFG(1,  11, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_12_JTAG_MUX_TDI                                    IMXRT_PADCFG(1,  12, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_LPUART1_RTS_B                                   IMXRT_PADCFG(1,  12, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_LPIT1_TRIGGER03                                 IMXRT_PADCFG(1,  12, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_TPM2_CH01                                       IMXRT_PADCFG(1,  12, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_GPIO1_IO12                                      IMXRT_PADCFG(1,  12, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_LPI2C1_HREQ                                     IMXRT_PADCFG(1,  12, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_12_LPSPI1_SCK                                      IMXRT_PADCFG(1,  12, 0x8, 1,   8, 0x1)

#define IOMUXC_PAD_GPIO_AON_13_JTAG_MUX_TCK                                    IMXRT_PADCFG(1,  13, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_13_LPUART12_CTS_B                                  IMXRT_PADCFG(1,  13, 0x2, 1,  23, 0x0)
#define IOMUXC_PAD_GPIO_AON_13_LPUART1_DSR_B                                   IMXRT_PADCFG(1,  13, 0x3, 1,  22, 0x0)
#define IOMUXC_PAD_GPIO_AON_13_TPM2_CH02                                       IMXRT_PADCFG(1,  13, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_13_GPIO1_IO13                                      IMXRT_PADCFG(1,  13, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_13_LPTMR1_ALT1                                     IMXRT_PADCFG(1,  13, 0x6, 1,  17, 0x1)
#define IOMUXC_PAD_GPIO_AON_13_LPSPI1_PCS0                                     IMXRT_PADCFG(1,  13, 0x8, 1,   6, 0x1)

#define IOMUXC_PAD_GPIO_AON_14_JTAG_MUX_TMS                                    IMXRT_PADCFG(1,  14, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_14_LPUART12_RTS_B                                  IMXRT_PADCFG(1,  14, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_14_LPUART1_DCD_B                                   IMXRT_PADCFG(1,  14, 0x3, 1,  21, 0x0)
#define IOMUXC_PAD_GPIO_AON_14_TPM2_CH03                                       IMXRT_PADCFG(1,  14, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_14_GPIO1_IO14                                      IMXRT_PADCFG(1,  14, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_14_LPTMR1_ALT2                                     IMXRT_PADCFG(1,  14, 0x6, 1,  18, 0x1)
#define IOMUXC_PAD_GPIO_AON_14_LPSPI1_SDO                                      IMXRT_PADCFG(1,  14, 0x8, 1,  10, 0x1)

#define IOMUXC_PAD_GPIO_AON_15_FLEXSPI2_BUS2BIT_B_DATA03                       IMXRT_PADCFG(1,  15, 0x0, 0,  61, 0x2)
#define IOMUXC_PAD_GPIO_AON_15_LPSPI2_PCS1                                     IMXRT_PADCFG(1,  15, 0x1, 1,  12, 0x0)
#define IOMUXC_PAD_GPIO_AON_15_LPUART12_TX                                     IMXRT_PADCFG(1,  15, 0x2, 1,  25, 0x0)
#define IOMUXC_PAD_GPIO_AON_15_LPUART1_RI_B                                    IMXRT_PADCFG(1,  15, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_15_LPI2C2_SDA                                      IMXRT_PADCFG(1,  15, 0x4, 1,   5, 0x0)
#define IOMUXC_PAD_GPIO_AON_15_GPIO1_IO15                                      IMXRT_PADCFG(1,  15, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_15_LPTMR1_ALT3                                     IMXRT_PADCFG(1,  15, 0x6, 1,  19, 0x1)
#define IOMUXC_PAD_GPIO_AON_15_LPSPI1_SDI                                      IMXRT_PADCFG(1,  15, 0x8, 1,   9, 0x1)
#define IOMUXC_PAD_GPIO_AON_15_I3C1_SDA                                        IMXRT_PADCFG(1,  15, 0x9, 1,   1, 0x0)

#define IOMUXC_PAD_GPIO_AON_16_FLEXSPI2_BUS2BIT_B_DATA02                       IMXRT_PADCFG(1,  16, 0x0, 0,  60, 0x2)
#define IOMUXC_PAD_GPIO_AON_16_LPSPI2_PCS0                                     IMXRT_PADCFG(1,  16, 0x1, 1,  11, 0x1)
#define IOMUXC_PAD_GPIO_AON_16_LPUART12_RX                                     IMXRT_PADCFG(1,  16, 0x2, 1,  24, 0x0)
#define IOMUXC_PAD_GPIO_AON_16_LPUART1_DTR_B                                   IMXRT_PADCFG(1,  16, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_16_LPI2C2_SCL                                      IMXRT_PADCFG(1,  16, 0x4, 1,   4, 0x0)
#define IOMUXC_PAD_GPIO_AON_16_GPIO1_IO16                                      IMXRT_PADCFG(1,  16, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_16_CAN1_TX                                         IMXRT_PADCFG(1,  16, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_16_LPUART7_CTS_B                                   IMXRT_PADCFG(1,  16, 0x8, 1,  29, 0x1)
#define IOMUXC_PAD_GPIO_AON_16_I3C1_SCL                                        IMXRT_PADCFG(1,  16, 0x9, 1,   0, 0x0)

#define IOMUXC_PAD_GPIO_AON_17_FLEXSPI2_BUS2BIT_B_DATA01                       IMXRT_PADCFG(1,  17, 0x0, 0,  59, 0x2)
#define IOMUXC_PAD_GPIO_AON_17_LPSPI2_SDI                                      IMXRT_PADCFG(1,  17, 0x1, 1,  15, 0x1)
#define IOMUXC_PAD_GPIO_AON_17_LPUART7_TX                                      IMXRT_PADCFG(1,  17, 0x2, 1,  31, 0x0)
#define IOMUXC_PAD_GPIO_AON_17_LPI2C2_SDA                                      IMXRT_PADCFG(1,  17, 0x3, 1,   5, 0x1)
#define IOMUXC_PAD_GPIO_AON_17_LPUART1_DSR_B                                   IMXRT_PADCFG(1,  17, 0x4, 1,  22, 0x1)
#define IOMUXC_PAD_GPIO_AON_17_GPIO1_IO17                                      IMXRT_PADCFG(1,  17, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_17_CAN1_RX                                         IMXRT_PADCFG(1,  17, 0x6, 0,   0, 0x3)

#define IOMUXC_PAD_GPIO_AON_18_FLEXSPI2_BUS2BIT_B_DATA00                       IMXRT_PADCFG(1,  18, 0x0, 0,  58, 0x2)
#define IOMUXC_PAD_GPIO_AON_18_LPSPI2_SDO                                      IMXRT_PADCFG(1,  18, 0x1, 1,  16, 0x1)
#define IOMUXC_PAD_GPIO_AON_18_LPUART7_RX                                      IMXRT_PADCFG(1,  18, 0x2, 1,  30, 0x0)
#define IOMUXC_PAD_GPIO_AON_18_LPI2C2_SCL                                      IMXRT_PADCFG(1,  18, 0x3, 1,   4, 0x1)
#define IOMUXC_PAD_GPIO_AON_18_LPUART1_DCD_B                                   IMXRT_PADCFG(1,  18, 0x4, 1,  21, 0x1)
#define IOMUXC_PAD_GPIO_AON_18_GPIO1_IO18                                      IMXRT_PADCFG(1,  18, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_18_CAN3_TX                                         IMXRT_PADCFG(1,  18, 0x6, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

