apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AON_19_FLEXSPI2_BUS2BIT_B_SCLK                         IMXRT_PADCFG(1,  19, 0x0, 0,  63, 0x1)
#define IOMUXC_PAD_GPIO_AON_19_LPSPI2_SCK                                      IMXRT_PADCFG(1,  19, 0x1, 1,  14, 0x0)
#define IOMUXC_PAD_GPIO_AON_19_FLEXSPI2_BUS2BIT_A_SS1_B                        IMXRT_PADCFG(1,  19, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_19_LPUART1_CTS_B                                   IMXRT_PADCFG(1,  19, 0x4, 1,  20, 0x1)
#define IOMUXC_PAD_GPIO_AON_19_GPIO1_IO19                                      IMXRT_PADCFG(1,  19, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_19_CAN3_RX                                         IMXRT_PADCFG(1,  19, 0x6, 0,   2, 0x4)
#define IOMUXC_PAD_GPIO_AON_19_LPUART7_RTS_B                                   IMXRT_PADCFG(1,  19, 0x8, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_19_LPUART12_TX                                     IMXRT_PADCFG(1,  19, 0x9, 1,  25, 0x1)
#define IOMUXC_PAD_GPIO_AON_19_ADC1_CONV_D00                                   IMXRT_PADCFG(1,  19, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_20_FLEXSPI2_BUS2BIT_B_DQS                          IMXRT_PADCFG(1,  20, 0x0, 0,  53, 0x2)
#define IOMUXC_PAD_GPIO_AON_20_FLEXSPI2_BUS2BIT_A_SS1_B                        IMXRT_PADCFG(1,  20, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_20_LPI2C1_SDA                                      IMXRT_PADCFG(1,  20, 0x2, 1,   3, 0x2)
#define IOMUXC_PAD_GPIO_AON_20_I3C1_SDA                                        IMXRT_PADCFG(1,  20, 0x3, 1,   1, 0x1)
#define IOMUXC_PAD_GPIO_AON_20_LPUART1_RTS_B                                   IMXRT_PADCFG(1,  20, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_20_GPIO1_IO20                                      IMXRT_PADCFG(1,  20, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_20_LPUART12_RX                                     IMXRT_PADCFG(1,  20, 0x9, 1,  24, 0x1)
#define IOMUXC_PAD_GPIO_AON_20_ADC1_CONV_D01                                   IMXRT_PADCFG(1,  20, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_21_FLEXSPI2_BUS2BIT_B_SS0_B                        IMXRT_PADCFG(1,  21, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_21_LPSPI2_PCS1                                     IMXRT_PADCFG(1,  21, 0x1, 1,  12, 0x1)
#define IOMUXC_PAD_GPIO_AON_21_LPI2C1_SCL                                      IMXRT_PADCFG(1,  21, 0x2, 1,   2, 0x2)
#define IOMUXC_PAD_GPIO_AON_21_I3C1_SCL                                        IMXRT_PADCFG(1,  21, 0x3, 1,   0, 0x1)
#define IOMUXC_PAD_GPIO_AON_21_SAI1_TX_DATA00                                  IMXRT_PADCFG(1,  21, 0x4, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_21_GPIO1_IO21                                      IMXRT_PADCFG(1,  21, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_21_FLEXSPI2_BUS2BIT_A_DQS                          IMXRT_PADCFG(1,  21, 0x8, 0,  52, 0x1)
#define IOMUXC_PAD_GPIO_AON_21_SAI1_RX_DATA01                                  IMXRT_PADCFG(1,  21, 0x9, 1,  35, 0x1)
#define IOMUXC_PAD_GPIO_AON_21_ADC1_CONV_D02                                   IMXRT_PADCFG(1,  21, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_22_FLEXSPI2_BUS2BIT_A_SS0_B                        IMXRT_PADCFG(1,  22, 0x0, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_22_LPI2C2_SDA                                      IMXRT_PADCFG(1,  22, 0x1, 1,   5, 0x2)
#define IOMUXC_PAD_GPIO_AON_22_LPUART7_TX                                      IMXRT_PADCFG(1,  22, 0x2, 1,  31, 0x1)
#define IOMUXC_PAD_GPIO_AON_22_LPUART12_CTS_B                                  IMXRT_PADCFG(1,  22, 0x3, 1,  23, 0x1)
#define IOMUXC_PAD_GPIO_AON_22_SAI1_TX_SYNC                                    IMXRT_PADCFG(1,  22, 0x4, 1,  38, 0x1)
#define IOMUXC_PAD_GPIO_AON_22_GPIO1_IO22                                      IMXRT_PADCFG(1,  22, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_22_LPSPI2_SCK                                      IMXRT_PADCFG(1,  22, 0x6, 1,  14, 0x1)
#define IOMUXC_PAD_GPIO_AON_22_CCMSRCGPC_CCMOBS1                               IMXRT_PADCFG(1,  22, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_22_ADC1_CONV_D03                                   IMXRT_PADCFG(1,  22, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_23_FLEXSPI2_BUS2BIT_A_SCLK                         IMXRT_PADCFG(1,  23, 0x0, 0,  62, 0x1)
#define IOMUXC_PAD_GPIO_AON_23_LPI2C2_SCL                                      IMXRT_PADCFG(1,  23, 0x1, 1,   4, 0x2)
#define IOMUXC_PAD_GPIO_AON_23_LPUART7_RX                                      IMXRT_PADCFG(1,  23, 0x2, 1,  30, 0x1)
#define IOMUXC_PAD_GPIO_AON_23_LPUART12_RTS_B                                  IMXRT_PADCFG(1,  23, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_23_SAI1_TX_BCLK                                    IMXRT_PADCFG(1,  23, 0x4, 1,  37, 0x1)
#define IOMUXC_PAD_GPIO_AON_23_GPIO1_IO23                                      IMXRT_PADCFG(1,  23, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_23_LPSPI2_SDO                                      IMXRT_PADCFG(1,  23, 0x6, 1,  16, 0x2)
#define IOMUXC_PAD_GPIO_AON_23_CCMSRCGPC_CCMOBS2                               IMXRT_PADCFG(1,  23, 0xa, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_23_ADC1_CONV_D04                                   IMXRT_PADCFG(1,  23, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_24_FLEXSPI2_BUS2BIT_A_DATA00                       IMXRT_PADCFG(1,  24, 0x0, 0,  54, 0x1)
#define IOMUXC_PAD_GPIO_AON_24_LPI2C1_SDA                                      IMXRT_PADCFG(1,  24, 0x1, 1,   3, 0x3)
#define IOMUXC_PAD_GPIO_AON_24_LPUART2_RTS_B                                   IMXRT_PADCFG(1,  24, 0x2, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_24_LPUART7_CTS_B                                   IMXRT_PADCFG(1,  24, 0x3, 1,  29, 0x2)
#define IOMUXC_PAD_GPIO_AON_24_SAI1_MCLK                                       IMXRT_PADCFG(1,  24, 0x4, 1,  32, 0x1)
#define IOMUXC_PAD_GPIO_AON_24_GPIO1_IO24                                      IMXRT_PADCFG(1,  24, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_24_LPSPI2_SDI                                      IMXRT_PADCFG(1,  24, 0x6, 1,  15, 0x2)
#define IOMUXC_PAD_GPIO_AON_24_ADC1_CONV_D05                                   IMXRT_PADCFG(1,  24, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_25_FLEXSPI2_BUS2BIT_A_DATA01                       IMXRT_PADCFG(1,  25, 0x0, 0,  55, 0x1)
#define IOMUXC_PAD_GPIO_AON_25_LPI2C1_SCL                                      IMXRT_PADCFG(1,  25, 0x1, 1,   2, 0x3)
#define IOMUXC_PAD_GPIO_AON_25_LPUART2_CTS_B                                   IMXRT_PADCFG(1,  25, 0x2, 1,  26, 0x1)
#define IOMUXC_PAD_GPIO_AON_25_LPUART7_RTS_B                                   IMXRT_PADCFG(1,  25, 0x3, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_25_SAI1_RX_DATA00                                  IMXRT_PADCFG(1,  25, 0x4, 1,  34, 0x1)
#define IOMUXC_PAD_GPIO_AON_25_GPIO1_IO25                                      IMXRT_PADCFG(1,  25, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_25_LPSPI2_PCS0                                     IMXRT_PADCFG(1,  25, 0x6, 1,  11, 0x2)
#define IOMUXC_PAD_GPIO_AON_25_SAI1_TX_DATA01                                  IMXRT_PADCFG(1,  25, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_25_ADC1_CONV_D06                                   IMXRT_PADCFG(1,  25, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

