apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_pinmux.h
#define IOMUXC_PAD_GPIO_AON_26_FLEXSPI2_BUS2BIT_A_DATA02                       IMXRT_PADCFG(1,  26, 0x0, 0,  56, 0x1)
#define IOMUXC_PAD_GPIO_AON_26_LPSPI2_PCS2                                     IMXRT_PADCFG(1,  26, 0x1, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_26_LPUART2_TX                                      IMXRT_PADCFG(1,  26, 0x2, 1,  28, 0x1)
#define IOMUXC_PAD_GPIO_AON_26_SAI1_RX_BCLK                                    IMXRT_PADCFG(1,  26, 0x4, 1,  33, 0x1)
#define IOMUXC_PAD_GPIO_AON_26_GPIO1_IO26                                      IMXRT_PADCFG(1,  26, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_26_ADC1_CONV_D07                                   IMXRT_PADCFG(1,  26, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_27_FLEXSPI2_BUS2BIT_A_DATA03                       IMXRT_PADCFG(1,  27, 0x0, 0,  57, 0x1)
#define IOMUXC_PAD_GPIO_AON_27_LPSPI2_PCS3                                     IMXRT_PADCFG(1,  27, 0x1, 1,  13, 0x1)
#define IOMUXC_PAD_GPIO_AON_27_LPUART2_RX                                      IMXRT_PADCFG(1,  27, 0x2, 1,  27, 0x1)
#define IOMUXC_PAD_GPIO_AON_27_SAI1_RX_SYNC                                    IMXRT_PADCFG(1,  27, 0x4, 1,  36, 0x1)
#define IOMUXC_PAD_GPIO_AON_27_GPIO1_IO27                                      IMXRT_PADCFG(1,  27, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_27_EWM_EWM_OUT_B                                   IMXRT_PADCFG(1,  27, 0x7, 0, IMXRT_PADCFG_NO_DSYIDX, 0)
#define IOMUXC_PAD_GPIO_AON_27_ADC1_CONV_RDY_CLK                               IMXRT_PADCFG(1,  27, 0xc, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#define IOMUXC_PAD_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_A_DQS                    IMXRT_PADCFG(1,  28, 0x0, 0,  52, 0x2)
#define IOMUXC_PAD_GPIO_AON_28_DUMMY_FLEXSPI2_BUS2BIT_B_DQS                    IMXRT_PADCFG(1,  28, 0x1, 0,  53, 0x3)
#define IOMUXC_PAD_GPIO_AON_28_DUMMY_GPIO1_IO28                                IMXRT_PADCFG(1,  28, 0x5, 0, IMXRT_PADCFG_NO_DSYIDX, 0)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_PINMUX_H */